{
 "days": [
  {
   "day": "2012-11-12",
   "slots": [
    {
     "slot": "09:30",
     "talks": [
      {
       "id": 759,
       "title": "Android Development Code Lab",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2098",
       "summary": "Dive into some of the latest and greatest features of the Android operating system in this interactive code lab. Developers will need Eclipse or Intellij installed as well as the Android SDK and the latest version of Android Development Tools and APIs.",
       "room": "BOF 1",
       "speaker": "Nick Butcher",
       "day": "2012-11-12",
       "from": "09:30",
       "to": "12:30",
       "type": "Hands-on Labs",
       "speakers": [
        "Nick Butcher",
        "Richard Hyndman"
       ],
       "tags": [
        "SDK",
        "android",
        "mobile"
       ]
      },
      {
       "id": 760,
       "title": "Starting off Vaadin 7 on the right foot",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1622",
       "summary": "In this session, we'll create a simple Vaadin 7 CRUD application. This talk begins with a short introduction on Vaadin's architecture. Then, we'll begin developing the application step by step, each step bringing an additional concept into play. At first, we'll create the project itself. This will let us detail how this could be done in Eclipse. Then, we'll go on to add a login window with fields and button: here, we'll detail how Vaadin uses event oriented programmation. Two option are available, one using interfaces, the other introspection, each will be discussed for pros and cons. This will be the time to have a look at layouts. At this time, a word will be said about Single Page Interface applications and we'll see how to change our screen content. Finally, we'll connect our UI layer to a database with various means (pure JDBC, Hibernate and/or JPA) and display the database content to the user. This will be the chance to have a look at some powerful Vaadin abstractions like Container and Item.",
       "room": "BOF 2",
       "speaker": "Nicolas Frankel",
       "day": "2012-11-12",
       "from": "09:30",
       "to": "12:30",
       "type": "Hands-on Labs",
       "speakers": [
        "Nicolas Frankel"
       ],
       "tags": [
        "web",
        "RIA",
        "vaadin"
       ]
      },
      {
       "id": 761,
       "title": "Modular Architecture Today",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2077",
       "summary": "Modularity is coming to the Java platform! OSGi is here today and Java SE will introduce the Jigsaw module system. Don’t wait to start designing modular software. Contrary to popular belief, you don't need a framework or a new runtime to start building modular software applications. You can start today. In this session, we'll examine what it means to develop modular software on the Java platform. We'll examine the goals and benefits of modular software, and explore the patterns of modular architecture that help us develop modular software systems. Using the modularity patterns from the book, \"Java Application Architecture: Modularity Patterns with Examples Using OSGi\", we'll show how to refactor an existing monolithic software system to an extensible system of collaborating modules.",
       "room": "Room 8",
       "speaker": "Kirk Knoernschild",
       "day": "2012-11-12",
       "from": "09:30",
       "to": "12:30",
       "type": "University",
       "speakers": [
        "Kirk Knoernschild"
       ],
       "tags": [
        "javase",
        "modules",
        "osgi"
       ]
      },
      {
       "id": 762,
       "title": "Play Framework - Crash Course",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1733",
       "summary": "Play Framework, the popular Java and Scala web framework was launched only half a year ago but it’s fair to say that it has taken the JVM web development community by storm. In this university session the Play core team will teach you how to get the best out of Play including a session about “Real world application development techniques” and another that will introduce you to “Realtime Web Programming”\r\n\r\nPart 1) Play Development techniques in the Real World\r\nPart 2) Playframework: Real Time Web for the JVM",
       "room": "Room 5",
       "speaker": "Peter Hausel",
       "day": "2012-11-12",
       "from": "09:30",
       "to": "12:30",
       "type": "University",
       "speakers": [
        "Peter Hausel",
        "Sadek Drobi",
        "Guillaume Bort"
       ],
       "tags": [
        "web",
        "PlayFramework",
        "Play",
        "web20"
       ]
      },
      {
       "id": 763,
       "title": "Intro to iOS6 for Java Developers",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2101",
       "summary": "In the mobile revolution of today it is important to understand at least the basics of all available platforms. Without a doubt, the iOS platform is playing a big role in this universe. It sure is useful to know how stuff works.\r\n\r\nTo create native applications for iOS, we will need to become familiar with Apple's proprietary language, Objective C. To some of us Java developers/enthusiasts it might look and feel weird at first, but Objective C is a powerful dynamic language, rooted in C.\r\n\r\nIn this university, we will discuss the difference in language concepts between Java and Objective C and we'll introduce you to the main principles of building an iOS app.",
       "room": "Room 4",
       "speaker": "Michael Seghers",
       "day": "2012-11-12",
       "from": "09:30",
       "to": "12:30",
       "type": "University",
       "speakers": [
        "Michael Seghers"
       ],
       "tags": [
        "iPhone",
        "iOS",
        "mobile",
        "Apple"
       ]
      },
      {
       "id": 764,
       "title": "First steps with Scala",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2061",
       "summary": "In this session we will provide an introduction to the Scala programming language, a language that fuses object oriented programming with functional programming.\r\n\r\nThe session will cover topics including (time permitting):\r\n\r\n* Using the Scala REPL\r\n* Control structures in Scala (while, if, try)\r\n* Type inference\r\n* Classes, Objects and Traits\r\n* Function Literals and Closures\r\n* Introduction to the Scala collections API\r\n* Avoiding nulls\r\n* For expressions\r\n* Approaching functional programming in Scala",
       "room": "Room 9",
       "speaker": "Dick Wall",
       "day": "2012-11-12",
       "from": "09:30",
       "to": "12:30",
       "type": "University",
       "speakers": [
        "Dick Wall",
        "Bill Venners"
       ],
       "tags": [
        "scala"
       ]
      }
     ]
    },
    {
     "slot": "13:30",
     "talks": [
      {
       "id": 766,
       "title": "Hands-On Intro to iOS6 for Java Developers",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2103",
       "summary": "In this hands-on lab, we will introduce you to building powerful enterprise iOS applications, following Apple's guidelines. You will learns how to use a UINavigationController, UIViewController and UITableViewController with all it's views and datasources. We will then learn how to provide some real-life data to those controllers and views using a simple REST API.\r\n\r\nSince we will be using Xcode in this sessions, it is advised to bring a laptop that runs OS X with Xcode installed on it. You can find Xcode in the App Store for free.",
       "room": "BOF 1",
       "speaker": "Michael Seghers",
       "day": "2012-11-12",
       "from": "13:30",
       "to": "16:30",
       "type": "Hands-on Labs",
       "speakers": [
        "Michael Seghers"
       ],
       "tags": [
        "iPhone",
        "iOS",
        "mobile",
        "Apple"
       ]
      },
      {
       "id": 767,
       "title": "Write your first Ceylon program with the language authors",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1914",
       "summary": "During this session, Gavin King (author of Ceylon) and Stéphane Épardaud (Ceylon team) will help you learn the Ceylon programming language, hand in hand, from downloading the tools, using the IDE, getting to know the various tools, the language SDK, all the way to running your own module repository and publishing your first Ceylon modules to it and to the official Ceylon module repository.\r\n\r\nNo knowledge of Ceylon required, though the audience should be familiar with the Java programming language.",
       "room": "BOF 2",
       "speaker": "Stephane Epardaud",
       "day": "2012-11-12",
       "from": "13:30",
       "to": "16:30",
       "type": "Hands-on Labs",
       "speakers": [
        "Stephane Epardaud",
        "Gavin King",
        "Emmanuel Bernard"
       ],
       "tags": [
        "Ceylon"
       ]
      },
      {
       "id": 768,
       "title": "From Runnable and synchronized() to parallel() and atomically()",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1701",
       "summary": "For about 15 years the Java multithreaded programming model has followed the evolution of CPUs and the growing needs of applications. \r\nMultithreaded programming poses two challenges for the developer: parallelize the processes, and ensure consistency of the data, \r\nwhile fully leveraging the computing power of modern multicore processors. \r\n\r\nThis lecture begins by describing precisely these challenges and their issues. It then describes the technical solutions available today, \r\nwhether in the JDK API or in the frameworks of the Java ecosystem. From the threads of Java 1.0, to the Fork / Join of Java 7, and the anticipated \r\nparallel () of Java 8, from synchronized and volatile to STM and actors, everything will be explained. Some algorithm upcoming issues will also be \r\nshown to illustrate the talk.",
       "room": "Room 8",
       "speaker": "José Paumard",
       "day": "2012-11-12",
       "from": "13:30",
       "to": "16:30",
       "type": "University",
       "speakers": [
        "José Paumard"
       ],
       "tags": [
        "multicore",
        "JDK8"
       ]
      },
      {
       "id": 769,
       "title": "Modular Java EE in the Cloud: A Practical Guide to Modularity in the Cloud Age.",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1804",
       "summary": "Java EE 6 is an awesome platform, but how do you design a system that can evolve for many years in production? And how do we run this stuff in the cloud? Designing a system that can evolve without creating a maintenance nightmare is not trivial. A service oriented, modular architecture will help a lot to replace parts of a system without breaking others. The only mature modularity approach for Java is OSGi - a framework that enables low-level modularity and services, but you still need APIs to create web applications, use transactions, access data sources etc. Without these APIs you will have a hard time building applications. Unfortunately OSGi and Java EE did not interoperate well in the past; But what if we want modularity in our architecture but also the ease-of-use of Java EE 6? In this university you will:\r\n\r\n1. Understand the benefits of a modular code base\r\n2. Learn how to mix OSGi and Java EE\r\n3. Manage modular cloud deployments using Apache ACE\r\n\r\n..and of course there will be lots of live coding!",
       "room": "Room 5",
       "speaker": "Bert Ertman",
       "day": "2012-11-12",
       "from": "13:30",
       "to": "16:30",
       "type": "University",
       "speakers": [
        "Bert Ertman",
        "Paul Bakker"
       ],
       "tags": [
        "modules",
        "cloud",
        "osgi"
       ]
      },
      {
       "id": 770,
       "title": "HTML5 and JavaScript Web Apps",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2093",
       "summary": "This session will give you the knowledge to write HTML5 applications in your production code today. We'll start out with a review of the current browser landscape (iOS, Android, Microsoft, Firefox, Chrome, Dolphin and Opera) and how to support both mobile device and desktop browsers in a production environment. We'll review core HTML5 and W3C APIs such as Web Storage, Web Sockets, Web Workers, Geolocation, and Device Orientation and examine how these APIs contrast between desktop and mobile environments.\r\n\r\nFrom there, we'll begin coding a offline capable, HTML5 based demo application using all the latest frameworks and APIs.",
       "room": "Room 4",
       "speaker": "Wesley Hales",
       "day": "2012-11-12",
       "from": "13:30",
       "to": "16:30",
       "type": "University",
       "speakers": [
        "Wesley Hales"
       ],
       "tags": [
        "HTML5",
        "CSS3",
        "javascript"
       ]
      },
      {
       "id": 771,
       "title": "What's new in Grails 2.x?",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2102",
       "summary": "In the last year, we've seen a steady stream of new features and improvements in Grails across several releases. From improvements to the interactive console that make day to day work easier to plugins that solve specific problems that most developers and companies face. What are these features? And why do they matter? Whether you're new to Grails or an old hand, you'll find something of value in this session as we answer those questions and do some on-the-fly coding with varied Grails applications.\r\n\r\nWe will also look at both Grails and its plugin system in the context of the challenges of modern weba pplication development: cloud, NoSQL, and rich HTML5/js user interfaces. The basic plumbing of a web\r\napplication is only a small part of the whole development story now, so it's important to understand how the web framework can help you with the rest of the story. Again, you will see one or two sample applications as we explore what it looks like to develop a next-gen web app.",
       "room": "Room 9",
       "speaker": "Peter Ledbrook",
       "day": "2012-11-12",
       "from": "13:30",
       "to": "16:30",
       "type": "University",
       "speakers": [
        "Peter Ledbrook"
       ],
       "tags": [
        "grails",
        "groovy"
       ]
      }
     ]
    },
    {
     "slot": "16:45",
     "talks": [
      {
       "id": 773,
       "title": "NoSQLUnit. Testing your NoSQL databases.",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1703",
       "summary": "Unit tests should follow the FIRST rules (Fast, Isolated, Repeatable, Self-Validated and Timely). When persistence layer is under test, fast and isolated rules are the most violated. For relational database management systems, embedded databases and DbUnit framework exist to help us to not break them, but there is no like DBUnit framework for heterogeneous NoSQL systems.\r\n\r\nNoSQLUnit aids us to not break these rules by providing a JUnit extension which helps us to manage lifecycle of NoSQL systems and also it takes care of maintaining databases into known state. NoSQLUnit can be used during unit tests, but also in high level tests like integration or acceptance tests.",
       "room": "Room 8",
       "speaker": "Alex Soto",
       "day": "2012-11-12",
       "from": "16:45",
       "to": "17:15",
       "type": "Tools in Action",
       "speakers": [
        "Alex Soto"
       ],
       "tags": [
        "Testing",
        "ATDD",
        "NoSQL",
        "Tools"
       ]
      },
      {
       "id": 774,
       "title": "Hacking the Java compiler for fun and profit",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1520",
       "summary": "For Java developers who want to work with the language and platform they love, the last two years have proven to be ground-breaking ones. Java SE 7 was released after a long five-year and brought many new features to make a Java programmer’s life simpler. Such features include reduced generics syntax, safe file handling, making large numbers etc. \r\n\r\nHowever, wouldn’t it be fun to be able to add your own favourite features to Java?\r\n\r\nIn this tutorial, we give an introduction to hacking the Java compiler by showing you how to implement a relatively simple new language syntax feature: the Elvis operator.\r\n\r\nYou will learn:\r\n- how to download and build the Java compiler source code\r\n- how a compiler works and an overview of the Java compiler architecture\r\n- how to modify the Java syntax and grammar\r\n- how to implement the Elvis operator as a feature of Java\r\n- how to test your implementation",
       "room": "Room 5",
       "speaker": "Raoul-gabriel Urma",
       "day": "2012-11-12",
       "from": "16:45",
       "to": "17:15",
       "type": "Tools in Action",
       "speakers": [
        "Raoul-gabriel Urma"
       ],
       "tags": [
        "javase",
        "openjdk"
       ]
      },
      {
       "id": 775,
       "title": "Rapid Application Development with Play 2",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1732",
       "summary": "Play 2 http://www.playframework.org/ the popular Java and Scala web framework is well known for its rapid application development support. In this talk you will learn about all the exciting features that should help you to get things done.\r\n\r\nA few topics being covered:\r\n- how to change your code and compile on the fly\r\n- how to take advantage of Play2's type safe templates and routes\r\n- play2 front end technology integration (coffeescript, LESS and google closure compiler integration)\r\n- packaging an application\r\n- peeking into your application using the REPL\r\n- running tests",
       "room": "Room 4",
       "speaker": "Peter Hausel",
       "day": "2012-11-12",
       "from": "16:45",
       "to": "17:15",
       "type": "Tools in Action",
       "speakers": [
        "Peter Hausel"
       ],
       "tags": [
        "web",
        "PlayFramework",
        "Play"
       ]
      },
      {
       "id": 776,
       "title": "Android DDD (Diet Driven Development)!",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1825",
       "summary": "Is your Android code growing big and fat? \r\n\r\nIt's time for a slim down: with AndroidAnnotations, you will lose 42% LOC in a few hours, money-back guaranteed! Oh, by the way... it's Open Source!\r\nTry it now, it works!\r\n\r\nWhy are we writing the same Android code over and over again? Why are our apps harder and harder to maintain? Context and Activity god objects, juggling with threads, loads of anonymous listener classes, tons of unneeded casts... can we improve that?\r\n\r\nWith a few Java annotations, developers can express their intentions and let AndroidAnnotations generate the boring boilerplate code at compile time, using the Java 6 Annotation Processing API.\r\n\r\nThe presentation will start by explaining the key concepts, followed by a live coding diet on a fat application to demonstrate AndroidAnnotations' advantages.\r\n\r\nhttp://androidannotations.org/",
       "room": "Room 9",
       "speaker": "Pierre-yves Ricau",
       "day": "2012-11-12",
       "from": "16:45",
       "to": "17:15",
       "type": "Tools in Action",
       "speakers": [
        "Pierre-yves Ricau",
        "Alexandre Thomas"
       ],
       "tags": [
        "annotations",
        "android"
       ]
      }
     ]
    },
    {
     "slot": "17:25",
     "talks": [
      {
       "id": 778,
       "title": "Weld-OSGi in action",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1817",
       "summary": "Originally created for embedded and mobile appliances, OSGi has become a widespread foundation for building modular and dynamic applications on top of the Java platform. Despite its maturity and proven track record, OSGi is more than often referred to as a source of significant complexity for no actual benefits.\r\nIn this presentation, we will show you how OSGi, CDI and Weld nicely fit together in Weld-OSGi to assemble regular and dynamic components with no added complexity on the developer side while providing all the powerness of OSGi, especially almost transparent interactions with the dynamic service registry.\r\nThis presentation will cover CDI and OSGi basics and then will deep dive into Weld-OSGi to expose each major feature. This presentation will be also a place for demos to see how you can highly benefit from this framework in your modular Java EE applications to make them completely dynamic.",
       "room": "Room 8",
       "speaker": "Mathieu Ancelin",
       "day": "2012-11-12",
       "from": "17:25",
       "to": "17:55",
       "type": "Tools in Action",
       "speakers": [
        "Mathieu Ancelin",
        "Matthieu Clochard"
       ],
       "tags": [
        "javaee",
        "CDI",
        "Weld",
        "osgi"
       ]
      },
      {
       "id": 779,
       "title": "Introduction to JavaFX Scenic View",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1964",
       "summary": "<placeholder>\r\nScenic View is a handy (and free!) tool for analysing a JavaFX scenegraph at runtime. Attend this session to learn more about this tool, and how to use it during the development of your own applications.\r\n</placeholder>",
       "room": "Room 5",
       "speaker": "Jonathan Giles",
       "day": "2012-11-12",
       "from": "17:25",
       "to": "17:55",
       "type": "Tools in Action",
       "speakers": [
        "Jonathan Giles"
       ],
       "tags": [
        "javafx"
       ]
      },
      {
       "id": 780,
       "title": "JavaFX on Smart Embedded Devices",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2094",
       "summary": "Overview of the upcoming JavaFX release on embedded devices powered by ARM chipsets. This session will describe the class of target hardware that can support the JavaFX stack, what JavaFX features will be supported on these devices and how to develop applications. We will show JavaFX applications running on readily available embedded hardware.",
       "room": "Room 4",
       "speaker": "Daniel Blaukopf",
       "day": "2012-11-12",
       "from": "17:25",
       "to": "17:55",
       "type": "Tools in Action",
       "speakers": [
        "Daniel Blaukopf"
       ],
       "tags": [
        "javafx",
        "javase"
       ]
      },
      {
       "id": 781,
       "title": "Code injection in  Android",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1865",
       "summary": "Tool allows to optimize, trace and modify Android project on the fly using code injection into existing project.\r\nCode is intected on the fly, no need to modify old functionality to add logging/profiling or disable portion of the flow. \r\n\r\nMain functionality of the tool:\r\n- trace: entering/exiting to/from method, collecting parameters and exiting value)\r\n- profile: measuring the frequency and duration of method calls\r\n- disable: disabling/skipping part of the program flow by overriding returning value from methods defined by the user.\r\n\r\nTool is written in Java and AspectJ, works with Eclipse.",
       "room": "Room 9",
       "speaker": "Andrei Karpushonak",
       "day": "2012-11-12",
       "from": "17:25",
       "to": "17:55",
       "type": "Tools in Action",
       "speakers": [
        "Andrei Karpushonak"
       ],
       "tags": [
        "Testing",
        "android",
        "Eclipse",
        "mobile",
        "Tools"
       ]
      }
     ]
    },
    {
     "slot": "18:05",
     "talks": [
      {
       "id": 783,
       "title": "Raise Your Java EE 6 Productivity Bar With JBoss Forge",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1864",
       "summary": "Getting started with Java EE development can, despite the important improvements over time, still be quite daunting for newbies. Putting a JSF application to work, setting up persistence or enabling restful web services are not trivial tasks.  \r\nJBoss Forge is a versatile and lean development environment entirely written in Java and making smart use of CDI. Its purpose is to offer you the possibility of incrementally working in new functionality into existing Java projects. It is a command-line oriented tool, so creating entities or scaffolding a user interface is just a matter of issuing a few commands. \r\nBut what if your task cannot be done by Forge? No worries, as Forge operates by means of plug-ins, the answer is simply to look for an appropriate plugin or create it yourself if one is not available. \r\nFinally, Forge can also be integrated in graphical IDE's opening up all its power to users of common platforms such as Eclipse.\r\nCome to this session if you want to see this powerful tool live in action!",
       "room": "Room 8",
       "speaker": "Koen Aers",
       "day": "2012-11-12",
       "from": "18:05",
       "to": "18:35",
       "type": "Tools in Action",
       "speakers": [
        "Koen Aers"
       ],
       "tags": [
        "javaee6"
       ]
      },
      {
       "id": 784,
       "title": "CRaSH an extensible command line for the JVM",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1846",
       "summary": "CRaSH is an open source shell for extending and monitoring a Java Virtual Machine. The shell can be accessed by various means, either remotely using network protocols such as SSH or locally by attaching a shell to a running virtual machine.\r\n\r\nCommands are written in the Groovy language and can be developed live making the extensibility of the shell easy with quick development cycles. CRaSH comes with a bunch of commands such as thread management, log management, database access and JMX.\r\n\r\nThe session will begin with a short introduction to the shell, showing basic CRaSH features like auto completion and basic commands. The main part of the quickie will focus on showing how to develop CRaSH commands with several examples, showing how easy and powerful the development of a command can be.\r\n\r\nThe target audience is pretty much anyone using a JVM. Attendees will learn how to install CRaSH, connect to an instance and develop a CRaSH command to interact with virtual machine resources or services.",
       "room": "Room 5",
       "speaker": "Julien Viet",
       "day": "2012-11-12",
       "from": "18:05",
       "to": "18:35",
       "type": "Tools in Action",
       "speakers": [
        "Julien Viet",
        "Alain Defrance"
       ],
       "tags": [
        "JMX",
        "VisualVM",
        "JVM",
        "groovy"
       ]
      },
      {
       "id": 785,
       "title": "Blast your webapp with Gatling",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1860",
       "summary": "Your application is going live tomorrow, the new marketing campaign is about to start, you enjoy a margarita, life is good. Yet something keeps bugging you, are you sure your webapp won't crash down? \"Damn, forgot about the stress tests!\"\r\n\r\nTraffic grows, data grows, our applications have to withstand increasing loads, so stress tests are more and more of a critical issue.\r\n\r\nGatling is a new generation stress tool developed in Scala. Its fully async engine based on Akka actors and Netty NIO makes it very efficient, and the rich yet simple DSL makes it very user-friendly. Your project managers will love it too, thanks to its relevant and portable reports.\r\n\r\nThis talk will cover the main principles of Gatling's architecture and demonstrate how quick and easy building stress tests with Gatling is.\r\n\r\nMore information about Gatling here:\r\nhttp://gatling-tool.org\r\nhttps://github.com/excilys/gatling",
       "room": "Room 4",
       "speaker": "Stéphane Landelle",
       "day": "2012-11-12",
       "from": "18:05",
       "to": "18:35",
       "type": "Tools in Action",
       "speakers": [
        "Stéphane Landelle",
        "Romain Sertelon"
       ],
       "tags": [
        "scala",
        "Testing"
       ]
      },
      {
       "id": 786,
       "title": "Hybrid mobile application development using Apache Cordova",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1959",
       "summary": "This Tools-in-Action talk will show you how to develop an hybrid mobile application for Android and iOS platform. After 2 slides and 5 minutes describing the Worklight development and runtime architecture, this hands-on, all demo talk will show you how to create a project from scratch, how to access native device functions such as the Camera or the GPS, how to deploy and test to your simulator first and to real devices next.  Tools and technologies demonstrated : IBM Worklight Studio (Eclipse based), Apache Cordova, HTML, Javascript, Android SDK, iOS SDK",
       "room": "Room 9",
       "speaker": "Sébastien Stormacq",
       "day": "2012-11-12",
       "from": "18:05",
       "to": "18:35",
       "type": "Tools in Action",
       "speakers": [
        "Sébastien Stormacq",
        "Abdoul gadiri Diallo"
       ],
       "tags": [
        "HTML",
        "iPhone",
        "javascript",
        "iOS",
        "mobile",
        "android"
       ]
      }
     ]
    },
    {
     "slot": "19:00",
     "talks": [
      {
       "id": 787,
       "title": "Scala Enthusiasts Gathering",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1612",
       "summary": "BeScala, the Belgian Scala Enthusiasts group, would like to invite all Scala users and fans coming to Devoxx for an informal meet-up.\r\n\r\nCome and exchange on all things about Scala and its community: organizing and animating a vibrant local user group, supporting and promoting adoption in the enterprise and any other topic around this exciting language.",
       "room": "BOF 1",
       "speaker": "Renato Guerra cavalcanti",
       "day": "2012-11-12",
       "from": "19:00",
       "to": "20:00",
       "type": "BOF",
       "speakers": [
        "Renato Guerra cavalcanti",
        "Tim Romberg",
        "Luc Duponcheel",
        "Louis Jacomet"
       ],
       "tags": [
        "scala",
        "JVM"
       ]
      },
      {
       "id": 788,
       "title": "Why JRuby and TorqueBox Belong in Your Java Tool Box",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2089",
       "summary": "This session will briefly introduce you to JRuby and TorqueBox and the value they can bring to a Java organization. Then we'll open things up for discussion where participants can ask questions and share their\r\nexperiences for the benefit of everyone. If your organization is considering deploying JRuby applications, you won't want to miss this!",
       "room": "BOF 2",
       "speaker": "Ben Browning",
       "day": "2012-11-12",
       "from": "19:00",
       "to": "20:00",
       "type": "BOF",
       "speakers": [
        "Ben Browning"
       ],
       "tags": [
        "jruby",
        "TorqueBox"
       ]
      }
     ]
    },
    {
     "slot": "20:00",
     "talks": [
      {
       "id": 789,
       "title": "Scala Puzzlers",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1492",
       "summary": "One of the most advanced programming languages of today has surely outgrown the gotchas, puzzlers and head-scratchers of the past. Really?\r\n\r\nPrepare to be surprised, entertained and...well, puzzled! We'll present a selection of seemingly simple examples which demonstrate that there's plenty of head-scratching left in Scala!\r\nLet your mind be challenged by unexpected and unintuitive behaviour and results and learn something about your favourite language in the process. And unlike in a real magic show, we'll even be giving away the solutions :-)",
       "room": "BOF 1",
       "speaker": "Andrew Phillips",
       "day": "2012-11-12",
       "from": "20:00",
       "to": "21:00",
       "type": "BOF",
       "speakers": [
        "Andrew Phillips"
       ],
       "tags": [
        "scala",
        "puzzlers"
       ]
      },
      {
       "id": 790,
       "title": "Hacking JavaFX TableView",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1965",
       "summary": "<placeholder>\r\nTableView is a very powerful UI control, but the API can often hide useful functionality. This session works through several tweaks and API features that may not be apparent upon first viewing of the API. Topics include the cell factory API, nested table columns, customizing table column headers, styling columns and rows, customizing the sorting API, and adding new menu items to the TableMenuButton. If time permits, the presentation may introduce and discuss a TreeTableView in a BOF-like manner so attendees can understand the internals of TableView.\r\n</placeholder>",
       "room": "BOF 2",
       "speaker": "Jonathan Giles",
       "day": "2012-11-12",
       "from": "20:00",
       "to": "21:00",
       "type": "BOF",
       "speakers": [
        "Jonathan Giles"
       ],
       "tags": [
        "javafx"
       ]
      }
     ]
    },
    {
     "slot": "21:00",
     "talks": [
      {
       "id": 791,
       "title": "Migrating Real-World Million-Line Code Bases to Java 7: Lessons Learned",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1795",
       "summary": "In enterprise development, migrating to a new version of Java can be a complex endeavor. However, the swift adoption of Java 7 by the community enables a smooth transition, if you plan ahead and take one small step at a time. In this session, you’ll hear about Info Support’s experiences with successful migrations on several large enterprise projects, such as the Dutch Railways planning system, a complex, million-line code base. The presentation shows real project statistics on performance and productivity improvements because of Java 7 and addresses several topics for migration: tools, frameworks, and language changes. It also discusses approaches to incrementally upgrading in a multiteam environment and how to minimize risk and effort.",
       "room": "BOF 1",
       "speaker": "Peter Hendriks",
       "day": "2012-11-12",
       "from": "21:00",
       "to": "22:00",
       "type": "BOF",
       "speakers": [
        "Peter Hendriks",
        "Tim Prijn"
       ],
       "tags": [
        "javase",
        "Java7",
        "Tools"
       ]
      },
      {
       "id": 792,
       "title": "Enterprise Testing (placeholder)",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2129",
       "summary": "TBA",
       "room": "BOF 2",
       "speaker": "Dan Allen",
       "day": "2012-11-12",
       "from": "21:00",
       "to": "22:00",
       "type": "BOF",
       "speakers": [
        "Dan Allen"
       ],
       "tags": [
        "Testing",
        "javaee",
        "Arquillian"
       ]
      }
     ]
    }
   ]
  },
  {
   "day": "2012-11-13",
   "slots": [
    {
     "slot": "09:30",
     "talks": [
      {
       "id": 794,
       "title": "OpenJDK Hack Session (Bugathon for the Adopt OpenJDK Program)",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1707",
       "summary": "As of Java 7, the OpenJDK is the Reference Implementation (RI) for Java. In essence, the OpenJDK is the Java we use every day! With legal and technical barriers become smaller every day, it is now more possible than ever to get involved in the language and VM that we all love.\r\n\r\nCome and join the Diabolical Developer and friends in a hands on workshop where you get to fix bugs in Java itself!  In this bugathon we'll pick an area of the OpenJDK that could do with some Duke love (such as applying project coin features to the libraries themselves).\r\n\r\nYou'll learn how Java is build, how the OpenJDK is managed as a project and most importantly how you can directly fix bugs and even potentially add new features to Java.",
       "room": "BOF 1",
       "speaker": "Martijn Verburg",
       "day": "2012-11-13",
       "from": "09:30",
       "to": "12:30",
       "type": "Hands-on Labs",
       "speakers": [
        "Martijn Verburg",
        "Ben Evans"
       ],
       "tags": [
        "javase",
        "JUG",
        "openjdk",
        "Java8"
       ]
      },
      {
       "id": 795,
       "title": "Building Modular Enterprise Applications in Java",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1812",
       "summary": "This lab will introduce the OSGi framework and how to create modular, service oriented, robust and durable enterprise applications. Modularity forces separation of concerns which, when combined with a service oriented architecture, enables you to replace parts of a system without breaking others.\r\n \r\nYou will learn all about OSGi implementations and the wealth of open source enterprise components, and how to combine those apparent opposite worlds into coherent applications. We will also show you all you need to know about setting up your development environment to get started right away.\r\n \r\nFinally, we will focus on deployment into the cloud, introducing Apache ACE, a software distribution framework that allows to centrally manage and distribute software components, configuration data, and other artifacts to target systems. We will focus on building and managing OSGi deployments, showing you how to use Apache ACE to bootstrap a framework and deploy to remotely managed systems in a cloud.",
       "room": "BOF 2",
       "speaker": "Paul Bakker",
       "day": "2012-11-13",
       "from": "09:30",
       "to": "12:30",
       "type": "Hands-on Labs",
       "speakers": [
        "Paul Bakker",
        "Bert Ertman",
        "Marcel Offermans"
       ],
       "tags": [
        "osgi"
       ]
      },
      {
       "id": 796,
       "title": "Important Android Stuff",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2060",
       "summary": "tba",
       "room": "Room 8",
       "speaker": "Chet Haase",
       "day": "2012-11-13",
       "from": "09:30",
       "to": "12:30",
       "type": "University",
       "speakers": [
        "Chet Haase",
        "Romain Guy"
       ],
       "tags": [
        "android",
        "mobile"
       ]
      },
      {
       "id": 797,
       "title": "To ATDD and beyond! Better Automated Acceptance Testing on the JVM",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1496",
       "summary": "Test Driven Development is a game changer for developers, but Automated Acceptance Testing (ATDD) is a game changer for the whole team! More than just a testing technique, Automated Acceptance Testing is both a collaboration tool and a vital step on the road to Continuous Delivery.\r\n\r\nIn this talk, you will see a real-world demo applying practical ATDD techniques to real-world projects using JBehave, Selenium 2 and Thucydides. Learn how to write better and more maintainable automated acceptance tests, and see how a well-designed set of automated acceptance tests can also be a powerful documentation and reporting tool. \r\n\r\nSee how tools like JBehave and Thucidides can help you structure your acceptance tests and generate powerful documentation, with narrative feature descriptions, screen shots, test coverage, and project progress reports. \r\n\r\nAnd learn how product owners use ATDD and Thucydides to drive, coordinate and document releases.",
       "room": "Room 5",
       "speaker": "John Smart",
       "day": "2012-11-13",
       "from": "09:30",
       "to": "12:30",
       "type": "University",
       "speakers": [
        "John Smart"
       ],
       "tags": [
        "ATDD"
       ]
      },
      {
       "id": 798,
       "title": "Java Social JSR, it's alive",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2086",
       "summary": "After the rejection of the java Social JSR, the development work really started. A number of people started to work on a \"reference implementation\" for Social Network integration in Java. \r\nIn this session, you will see examples from a number of frameworks that help developers to integrate their projects with existing Social Networks (e.g. Facebook, Twitter)",
       "room": "Room 4",
       "speaker": "Antoine Sabot-durand",
       "day": "2012-11-13",
       "from": "09:30",
       "to": "12:30",
       "type": "University",
       "speakers": [
        "Antoine Sabot-durand",
        "Werner Keil"
       ],
       "tags": [
        "javaee",
        "Twitter",
        "social",
        "facebook"
       ]
      },
      {
       "id": 799,
       "title": "Scala advanced concepts and best practices",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2063",
       "summary": "This session is intended for current scala practitioners with at least a few months of experience in writing Scala. It is not intended as a follow on course from Session 1, and may be bewildering or difficult to follow for newcomers to Scala (it is not recommended for newcomers). \r\n\r\nTopics covered (time permitting) include:\r\n* Idiomatic Scala\r\n* Scala API design and design patterns\r\n* Implicit conversions, parameters and implicit context\r\n* Advanced pattern matching, partial functions, actors\r\n* Extractors\r\n* What's new in Scala 2.10\r\n* Tail calls, trampolines and continuations",
       "room": "Room 9",
       "speaker": "Dick Wall",
       "day": "2012-11-13",
       "from": "09:30",
       "to": "12:30",
       "type": "University",
       "speakers": [
        "Dick Wall",
        "Bill Venners"
       ],
       "tags": [
        "scala"
       ]
      }
     ]
    },
    {
     "slot": "13:30",
     "talks": [
      {
       "id": 805,
       "title": "Building awesome client-side web apps with AngularJS",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1692",
       "summary": "This is a hands-on follow up session on the AngularJS \"conference\" presentation.\r\n\r\nWe are going to build a spiffed-up version of the AngularJS tutorial app[1] from scratch in a TDD fashion.\r\n\r\nAttendees will get familiar not only with the AngularJS framework itself, but experience the full workflow which includes writing and running tests, debugging and troubleshooting problems and building and packaging their application for deployment.\r\n\r\nTechnologies that the attendees will be exposed to:\r\n\r\n- AngularJS (of course)\r\n- HTML5 and JavaScript\r\n- Testacular http://vojtajina.github.com/testacular (we are applying for a presentation on this spectacular test runner for JavaScript)\r\n- Yeoman http://yeoman.io (just announced at Google IO)\r\n- git (very light intro - the existing tutorial uses git to allow developers to jump between various states of the tutorial and reset their working directory after doing exercises and experiments)\r\n\r\n[1] http://docs.angularjs.org/tutorial",
       "room": "BOF 1",
       "speaker": "Igor Minar",
       "day": "2012-11-13",
       "from": "13:30",
       "to": "16:30",
       "type": "Hands-on Labs",
       "speakers": [
        "Igor Minar",
        "Misko Hevery",
        "Vojta Jina"
       ],
       "tags": [
        "HTML5",
        "Testing",
        "javascript",
        "RIA",
        "TDD",
        "Tools"
       ]
      },
      {
       "id": 806,
       "title": "Practical - Scala Koans",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2062",
       "summary": "This hands-on lab will work through the Scala Koans with instructor guidance and help. Scala Koans is an open source project that provides small, manageable coding lessons to learn the basics of Scala upon the path to Scala enlightenment.\r\n\r\nAttendees will need their own laptop and instructions will be provided ahead of time to get the Scala compiler and related tools working for the session. The Koans themselves are built around a sequence of tests that you have to get working to move forward to the next problem.\r\nThis session will provide hands on experience with Scala coding and confidence to carry on both the koans and general scala development solo after the session is completed.",
       "room": "BOF 2",
       "speaker": "Dick Wall",
       "day": "2012-11-13",
       "from": "13:30",
       "to": "16:30",
       "type": "Hands-on Labs",
       "speakers": [
        "Dick Wall",
        "Bill Venners"
       ],
       "tags": [
        "scala"
       ]
      },
      {
       "id": 807,
       "title": "Faster Websites: Crash Course on Frontend Performance",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1526",
       "summary": "Backend architecture matters, but chances are, most of the performance problems in your new and awesome web app are in the frontend: too many external resources, request serialization, suboptimal layout and JavaScript execution.\r\n\r\nWe'll start at the beginning: how does the browser layout the page, what are the HTML5 optimizations that can help us improve the user experience, and what are the tools that can assist us in this quest? We'll dive into Chrome Dev Tools, explore the new W3C performance specs and what they can offer, and investigate several case studies to illustrate the common pitfalls. By the end of the session, you'll be able to shave several seconds off your page load time - yes, all in the frontend! \r\n\r\nAnd for the backend geeks, we'll take a quick look at lessons learned with SPDY, talk about open source page optimization (and automation) tools like PageSpeed, and also take a quick foray into the optimizations for the mobile web.",
       "room": "Room 8",
       "speaker": "Ilya Grigorik",
       "day": "2012-11-13",
       "from": "13:30",
       "to": "16:30",
       "type": "University",
       "speakers": [
        "Ilya Grigorik"
       ],
       "tags": [
        "HTML5",
        "performance",
        "CSS3",
        "web",
        "javascript",
        "analysis",
        "apache",
        "mobile",
        "Chrome"
       ]
      },
      {
       "id": 808,
       "title": "Performance Optimization Methodology",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2033",
       "summary": "Performance optimization has always thought to be a fine art as it could not be easily formalized, or constrained into one solid workflow. However, there are common patterns all performance engineers could follow in their investigations. This session describes some approaches and tools to analyise modern application performance problems in J2SE and hardware.",
       "room": "Room 5",
       "speaker": "Aleksey Shipilev",
       "day": "2012-11-13",
       "from": "13:30",
       "to": "16:30",
       "type": "University",
       "speakers": [
        "Aleksey Shipilev",
        "Kirk Pepperdine"
       ],
       "tags": [
        "performance",
        "Methodology"
       ]
      },
      {
       "id": 809,
       "title": "The newest JAX-RS and JPA Features",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2100",
       "summary": "Part 1\r\nThe final release of JAX-RS 2.0 is just days ahead! To get you started with the new features right away we will take a close look at the Client-API, Filters, Validators and Asynchronous Processing.\r\n\r\nThe scene will be set by aspects of building larger systems from autonomous but interacting services. We will dive into common practical questions and you will learn how 2.0 helps you to put clients into your services, implement advanced content negotiation, simplify logging and monitoring or create scriptable test clients.\r\n\r\nPart 2\r\nThe Java Persistence API (JPA) release 2.1 is coming in Java EE 7 and offers a number of cool new features like CDI integration, stored procedure support, and more. In this university session we'll look at the new JPA 2.1 features and the benefits they provide.  We'll also demo the features that have been implemented in time for Devoxx by the EclipseLink team who are building the JPA 2.1 reference implementation.",
       "room": "Room 4",
       "speaker": "Jan Algermissen",
       "day": "2012-11-13",
       "from": "13:30",
       "to": "16:30",
       "type": "University",
       "speakers": [
        "Jan Algermissen",
        "Shaun Smith"
       ],
       "tags": [
        "JPA2",
        "EclipseLink",
        "REST",
        "JAX-RS"
       ]
      },
      {
       "id": 810,
       "title": "JavaFX uni session",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2079",
       "summary": "JavaFX uni session",
       "room": "Room 9",
       "speaker": "Jim Weaver",
       "day": "2012-11-13",
       "from": "13:30",
       "to": "16:30",
       "type": "University",
       "speakers": [
        "Jim Weaver",
        "Gerrit Grunwald"
       ],
       "tags": [
        "javafx"
       ]
      }
     ]
    },
    {
     "slot": "16:45",
     "talks": [
      {
       "id": 812,
       "title": "Introducing PersistIt: Open-source Java, Key-Value Storage that Beats Native Alternatives",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2018",
       "summary": "Persistit is a new open source library that provides fast, embeddable, and compact B-Tree library built purely in Java which provides simple key-value storage for any Java application.   Similar in concept to BerkeleyDB, InnoDB, and Kyoto Cabinet DBM, the core use-case is applications that require an extremely fast, in-process storage engine for arbitrary data.   If you need to store, sort, and retrieve data PersistIt provides a pure-Java B-Tree with performance that rivals alternative native implementations.\r\n\r\nThis presentation focuses on using PersistIt for developing embedded applications, collecting log files, and an example of tracking application data using an in-process B-Tree on a mobile device.  Persistit works like a collection of Java Maps that are persistent, unlimited in size and capable of being shared among many threads. As a persistence product, Persistit offers all the benefits of fast Key-Value storage with the additional advantages of transactional durability and strong crash-recovery.",
       "room": "Room 8",
       "speaker": "Tim O'brien",
       "day": "2012-11-13",
       "from": "16:45",
       "to": "17:15",
       "type": "Tools in Action",
       "speakers": [
        "Tim O'brien",
        "Ori Herrnstadt"
       ],
       "tags": [
        "javase",
        "performance",
        "NoSQL"
       ]
      },
      {
       "id": 813,
       "title": "Testacular - Spectacular Test Runner for JavaScript",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1694",
       "summary": "Introduction to Testacular - test runner that makes makes testing JavaScript applications in real browsers frictionless and enjoyable.\r\n\r\nTesting is not optional when one is building a JavaScript application that must work across many browsers and devices. However executing tests in all of these various environments is hard. Testacular turns this typically pain-staking task into a piece of cake. It allows you to execute JavaScript tests in real browsers or devices such as your phone or tablet directly from the comfort of your terminal or your favorite IDE.\r\n\r\nhttp://vojtajina.github.com/testacular/",
       "room": "Room 5",
       "speaker": "Vojta Jina",
       "day": "2012-11-13",
       "from": "16:45",
       "to": "17:15",
       "type": "Tools in Action",
       "speakers": [
        "Vojta Jina"
       ],
       "tags": [
        "Testing",
        "web",
        "javascript",
        "TDD"
       ]
      },
      {
       "id": 814,
       "title": "‘Back to the Future’ – Taking Arduino back to its Java roots to move forward",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1870",
       "summary": "Arduino began life as the java based Processing IDE, which forked as Wiring, and again as Arduino and again as MPIDE. Needless to say with all this forking things are starting to break!\r\n\r\nThe Muvium V18’O Plugin includes an Ahead-Of-Time compiler, USB HID programmer and Emulator taking Arduino ‘Back to the Future’ by plugging into Processing and supporting Java in place of Arduino “NQJ” (Not-Quite-Java) \r\n\r\nBenefits include\r\n* Tighter integration with the Processing ecosystem\r\n* Java better suited for teaching and professional development\r\n* Dynamic Objects, Garbage Collection, Exceptions, Inheritance, Interfaces and other java language features missing from Arduino make code easier to develop and share\r\n* Emulation is ideal for testing and sharing code but missing from Arduino\r\n* In-Circuit debugging is also missing from Arduino. Muvium supports JDWP ready for use with Eclipse/Netbeans for those who outgrow Processing\r\n\r\nDemonstration includes Installation, Use of the Emulator and Programming a Real V18’O",
       "room": "Room 4",
       "speaker": "James Caska",
       "day": "2012-11-13",
       "from": "16:45",
       "to": "17:15",
       "type": "Tools in Action",
       "speakers": [
        "James Caska"
       ],
       "tags": [
        "JVM"
       ]
      },
      {
       "id": 815,
       "title": "Connect ALM tools thanks to the Open Services for Lifecycle Collaboration specification",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1908",
       "summary": "The overall acceptance of ALM (Application Lifecycle Management) platforms is growing slowly. A likely barrier to take-up is their limited tool interoperability. Currently, each ALM platform vendor predetermines a list of tools with which its ALM platform connects. Unfortunately, connecting new tools often requires integration effort. The Open Services for Lifecycle Collaboration specification (OSLC) is changing the game. If a tool provides an API compliant with the OSLC specification, it will then seamlessly integrate with OSLC-compliant ALM platforms. Few commercial ALM platforms currently implement the OSLC specifications, but a growing number of tools are now proposing OSLC compliant API.\r\nAfter a presentation of the current ALM platforms situation, a review of ALM tools is presented. Subsequently, a several queries where data from different tools are aggregated are used to demonstrate the power of OSLC. Finally, the talk concludes on the perspective and challenges of ALM platforms of the future.",
       "room": "Room 9",
       "speaker": "Jean-christophe Deprez",
       "day": "2012-11-13",
       "from": "16:45",
       "to": "17:15",
       "type": "Tools in Action",
       "speakers": [
        "Jean-christophe Deprez"
       ],
       "tags": [
        "ALM",
        "Tools"
       ]
      }
     ]
    },
    {
     "slot": "17:25",
     "talks": [
      {
       "id": 817,
       "title": "Maven dependency puzzlers",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1720",
       "summary": "We release our dependency information as pom.xml files on a maven repository. But how well do we understand the effect of these pom.xml files on our users? What problems do we create in ours and their dependency resolution?\r\n\r\nIn this session, you’ll be presented with several Maven puzzlers. Each Maven puzzler is a small POM configuration with a multiple-choice question about the output. Some puzzlers are easy, others are hard. Whoever answers most puzzlers correctly, wins.",
       "room": "Room 8",
       "speaker": "Geoffrey De smet",
       "day": "2012-11-13",
       "from": "17:25",
       "to": "17:55",
       "type": "Tools in Action",
       "speakers": [
        "Geoffrey De smet"
       ],
       "tags": [
        "Maven"
       ]
      },
      {
       "id": 818,
       "title": "Android Tools in Action",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2085",
       "summary": "This talk provides a quick introduction to and demo of the Android development processs, showing how to create, edit, build and debug Android phone and tablet applications, and how to analyze memory and performance issues.",
       "room": "Room 5",
       "speaker": "Tor Norbye",
       "day": "2012-11-13",
       "from": "17:25",
       "to": "17:55",
       "type": "Tools in Action",
       "speakers": [
        "Tor Norbye",
        "Xavier Ducrohet"
       ],
       "tags": [
        "android",
        "mobile",
        "Tools"
       ]
      },
      {
       "id": 819,
       "title": "FastOQL - Fast Object Queries for Hibernate",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1932",
       "summary": "To search for a set of objects or data that satisfy some complex criteria, spanning over many classes and relationships, Hibernate developers use HQL queries. However, it is a well-known problem that complex HQL queries, with many joins across class hierarchies, may perform very poorly, especially if executed on large databases. In such cases, Hibernate developers often escape to native SQL, giving up the object perspective and compactness of queries. Complex SQL queries are, however, cumbersome and difficult to maintain. FastOQL solves this problem by producing optimal SQL queries with a minimal number of joins from object queries. FastOQL is a Java library that compiles OQL (Object Query Language) queries into efficient SQL queries. It is designed to work with Hibernate, as an alternative to its HQL, to address its performance and scalability problems. If the domain model has inheritance hierarchies and/or collections mapped to association tables, FastOQL can bring substantial performance benefits.",
       "room": "Room 4",
       "speaker": "Žarko Mijailović",
       "day": "2012-11-13",
       "from": "17:25",
       "to": "17:55",
       "type": "Tools in Action",
       "speakers": [
        "Žarko Mijailović",
        "Srđan Luković",
        "Dragan Milicev"
       ],
       "tags": [
        "ORM",
        "performance",
        "Hibernate",
        "sql"
       ]
      },
      {
       "id": 820,
       "title": "10 Months of MongoDB at Nokia Entertainment Bristol",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1650",
       "summary": "A look at how a small group of self-motivated developers went about introducing, first themselves, and then their organisation to MongoDB. What made them do it? How did they gain acceptance for a new storage system amongst their peers, administrators and development managers? What was it like to actually write code around MongoDB? \r\n\r\nJoin me for the answers and get the inside story of an adoption not yet a year old.",
       "room": "Room 9",
       "speaker": "Tom Coupland",
       "day": "2012-11-13",
       "from": "17:25",
       "to": "17:55",
       "type": "Tools in Action",
       "speakers": [
        "Tom Coupland"
       ],
       "tags": [
        "javase",
        "DevOps",
        "ORM",
        "MongoDB"
       ]
      }
     ]
    },
    {
     "slot": "18:05",
     "talks": [
      {
       "id": 963,
       "title": "JDK 8 demo : Lambdas in Action",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1895",
       "summary": "With \"JDK8 Preview with Lambda support\" you can start writing and executing code with lambdas and look at new APIs that are made possible with lambdas.\r\n\r\nIn this demo of the JDK8 Peview I will quickly go through various possible lambda syntaxes. The code will use some of the new collection APIs as example to show the major concepts and evolutions linked to lambdas.",
       "room": "Room 8",
       "speaker": "Guillaume Tardif",
       "day": "2012-11-13",
       "from": "18:05",
       "to": "18:35",
       "type": "Tools in Action",
       "speakers": [
        "Guillaume Tardif"
       ],
       "tags": [
        "JDK8",
        "Lambda"
       ]
      },
      {
       "id": 964,
       "title": "How to solve memory leaks within minutes with Plumbr",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1882",
       "summary": "Plumbr is a memory leak detection tool that makes solving memory leaks easy. It launched beta in the end of 2011 and quickly became popular and received thousands of downloads. The product launched an official 1.0 version in June 2012 and has been used by many companies since.\r\n\r\nIn the session we will:\r\n* get a quick re-cap of what constitute a memory leak in garbage-collected JVM\r\n* create a simple classloader leak and a heap leak on the fly\r\n* see the effects that the leaks have to the permgen and heap usage\r\n* see how Plumbr detects the leaks and study the leak reports\r\n* solve the leaks and verify that the application is leak-free\r\n\r\nThe presentation is targeted towards Java developers and Java system administrators. You will learn how to recognize a memory leak and how to solve the most common cases of it. No previous knowledge of JVM internals required.",
       "room": "Room 5",
       "speaker": "Nikita Salnikov-tarnovski",
       "day": "2012-11-13",
       "from": "18:05",
       "to": "18:35",
       "type": "Tools in Action",
       "speakers": [
        "Nikita Salnikov-tarnovski",
        "Priit Potter"
       ],
       "tags": [
        "javase",
        "JVM"
       ]
      },
      {
       "id": 965,
       "title": "JUnit Rules",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1588",
       "summary": "We all know JUnit rulez. But do you know JUnit Rules? Rules are a not so well known feature of JUnit. They allow us to encapsulate setup and teardown in a reusable package. You can  manipulate the way tests get executed as well. \r\n\r\nIn this session we'll see what Rules actually are, how they work and what can get achieved with them.",
       "room": "Room 4",
       "speaker": "Jens Schauder",
       "day": "2012-11-13",
       "from": "18:05",
       "to": "18:35",
       "type": "Tools in Action",
       "speakers": [
        "Jens Schauder"
       ],
       "tags": [
        "javase",
        "Testing"
       ]
      },
      {
       "id": 966,
       "title": "Measuring performance and capacity planning in Java-based data grids",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1934",
       "summary": "Measuring your data grid's performance it's not a trivial task. In this presentation, Mircea Markus will introduce project Radargun: a benchmarking framework that helps measuring the performance and throughput of in-memory data grids. Radargun offers an simple and effective way to compare how various data grid products would behave based on a specific use case helping you to chose the one that fits your need. It also makes it a great tool setting up a prototyping your data-grid based application in a matter of minutes.",
       "room": "Room 9",
       "speaker": "Mircea Markus",
       "day": "2012-11-13",
       "from": "18:05",
       "to": "18:35",
       "type": "Tools in Action",
       "speakers": [
        "Mircea Markus"
       ],
       "tags": [
        "performance",
        "scalable",
        "clusters"
       ]
      }
     ]
    },
    {
     "slot": "19:00",
     "talks": [
      {
       "id": 823,
       "title": "The new Android Build System",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2091",
       "summary": "We will talk about the upcoming Gradle based Build System for the Android SDK that uses proper dependency management and allows for bundle distributions of Libraries. We will present and demo what already has been developed and discuss the roadmap and how the new build system will be rolled out. One goal of the BOF is to provide plenty of room to discuss with the audience their build requirements for Android development.",
       "room": "BOF 1",
       "speaker": "Hans Dockter",
       "day": "2012-11-13",
       "from": "19:00",
       "to": "20:00",
       "type": "BOF",
       "speakers": [
        "Hans Dockter",
        "Xavier Ducrohet"
       ],
       "tags": [
        "mobile",
        "android"
       ]
      },
      {
       "id": 824,
       "title": "ArduPilot: an Introduction to UAVs",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1573",
       "summary": "An introduction to ArduPilot powered Unmanned Aerial Vehicles (UAVs). This presentation will be for non experienced users explaining what is needed to get started with affordable amateur UAVs. Focus is set on explanation of how these systems work covering both hardware (arduino based processor board and sensor shield) and software (arduino code, inner and outer loop, pid controller). At the end I will give some real world examples. ",
       "room": "BOF 2",
       "speaker": "Hans Cappelle",
       "day": "2012-11-13",
       "from": "19:00",
       "to": "20:00",
       "type": "BOF",
       "speakers": [
        "Hans Cappelle"
       ],
       "tags": [
        "javase"
       ]
      }
     ]
    },
    {
     "slot": "20:00",
     "talks": [
      {
       "id": 825,
       "title": "Android Custom Components",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1508",
       "summary": "Android comes with many built-in components, but some tasks are best accomplished by rolling your own.\r\n\r\nWe will start from a simple example of enhancing the TextView class, and finish with a complete custom view with its own size measurement, drawing function and custom attributes. We will also discuss the best practices for custom views. What is the different between a custom view and a fragment? How about a compound control? When to use which?\r\n\r\nBy the end of the session, you will know not only how to create reusable custom components, but when to use them.",
       "room": "BOF 1",
       "speaker": "Chiu-ki Chan",
       "day": "2012-11-13",
       "from": "20:00",
       "to": "21:00",
       "type": "BOF",
       "speakers": [
        "Chiu-ki Chan"
       ],
       "tags": [
        "android",
        "mobile"
       ]
      },
      {
       "id": 826,
       "title": "The Fascinating World of NAO",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2099",
       "summary": "In this BOF we will dive into the enchanting world of the NAO robot, a humanoid robot made by Aldebaran Robotics in Paris.\r\n\r\nThis is an unconference, so the session will be interactive if desired by the audience. \r\n\r\nThe following topics are prepared for presentation: a bit of history of the NAO robot, of course a live demo, discussion of the NAO hardware, general concepts of NAO programming, programming showcases using the graphical Choregraphe environment, Python and low-level C++. If time remains: the embedded Linux operating system, NAOSim and programming NAO in Java.\r\n\r\nThere is no obligation to cover all topics. The audience will decide what is of most interest for them.\r\n\r\n(Please note that the topic of programming NAO in Java is covered by a specific conference talk given by developers from Aldebaran Robotics).",
       "room": "BOF 2",
       "speaker": "Tasha Carl",
       "day": "2012-11-13",
       "from": "20:00",
       "to": "21:00",
       "type": "BOF",
       "speakers": [
        "Tasha Carl"
       ],
       "tags": [
        "robotics"
       ]
      }
     ]
    },
    {
     "slot": "21:00",
     "talks": [
      {
       "id": 827,
       "title": "A Decade of Shipwrecks: The Past, Present, and Future of Builds",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2027",
       "summary": "In this presentation, Tim O'Brien gives an overview of build tools from gmake in the late 1990s to Gradle and Maven in 2012.  Instead of focusing on builds, this presentation tries to reset the discussion to focus on requirements rather than features.  What is it that we're looking for from our builds, and why have current approaches failed?\r\n\r\nThis BOF explores the following questions: What are trends in build tools?   What are the persistent problems?   How many of us are still dissatisfied with the build tools we use and how can we as participants in open source affect positive change? This presentation outlines the remaining problems with builds that are yet to solved and develops a framework to discuss how builds need to evolve going forward.",
       "room": "BOF 1",
       "speaker": "Tim O'brien",
       "day": "2012-11-13",
       "from": "21:00",
       "to": "22:00",
       "type": "BOF",
       "speakers": [
        "Tim O'brien"
       ],
       "tags": [
        "javase",
        "Tools"
       ]
      },
      {
       "id": 828,
       "title": "The Spring BOF",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2056",
       "summary": "Join Spring Developer Advcocate Josh Long and other SpringSource engineers at this Spring-oriented birds of a feather to talk roadmaps, community, technology and much more.",
       "room": "BOF 2",
       "speaker": "Josh Long",
       "day": "2012-11-13",
       "from": "21:00",
       "to": "22:00",
       "type": "BOF",
       "speakers": [
        "Josh Long"
       ],
       "tags": [
        "spring"
       ]
      }
     ]
    }
   ]
  },
  {
   "day": "2012-11-14",
   "slots": [
    {
     "slot": "09:30",
     "talks": [
      {
       "id": 830,
       "title": "Welcome & Announcements",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2092",
       "summary": "na",
       "room": "Room 8",
       "speaker": "Stephan Janssen",
       "day": "2012-11-14",
       "from": "09:30",
       "to": "10:10",
       "type": "Conference",
       "speakers": [
        "Stephan Janssen"
       ],
       "tags": [
        "Devoxx",
        "parleys"
       ]
      }
     ]
    },
    {
     "slot": "10:10",
     "talks": [
      {
       "id": 831,
       "title": "Make the Future Java",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2121",
       "summary": "The future course for modern day living—in both the enterprise business world and consumer arena—is being positively influenced by the ongoing innovation and value of Java. From enterprise application development to cloud computing to embedded machine-to-machines systems, Java continues to drive the applications and devices that enrich our interactivity with the world around us. In this keynote, we will demonstrate Oracle's continued commitment and positive stewardship of Java, as well as provide a glimpse of the future which showcases the vast opportunities that Java provides.",
       "room": "Room 8",
       "speaker": "Nandini Ramani",
       "day": "2012-11-14",
       "from": "10:10",
       "to": "10:55",
       "type": "Conference",
       "speakers": [
        "Nandini Ramani"
       ],
       "tags": [
        "javafx",
        "javase"
       ]
      }
     ]
    },
    {
     "slot": "10:55",
     "talks": [
      {
       "id": 832,
       "title": "When Geek Leaks",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2070",
       "summary": "tba",
       "room": "Room 8",
       "speaker": "Neal Ford",
       "day": "2012-11-14",
       "from": "10:55",
       "to": "11:40",
       "type": "Conference",
       "speakers": [
        "Neal Ford"
       ],
       "tags": [
        "Methodology"
       ]
      }
     ]
    },
    {
     "slot": "12:00",
     "talks": [
      {
       "id": 835,
       "title": "What’s New in JavaFX",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1637",
       "summary": "This session showcases all the cool new features added in the last year to JavaFX and gives ideas on how to best use those features for new applications. In the last year, there have been many advances in the JavaFX platform in several major releases. This session highlights the most exciting ones and showcases, with examples, how they can be used with cool results for real-world applications.",
       "room": "Room 8",
       "speaker": "Jasper Potts",
       "day": "2012-11-14",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Jasper Potts",
        "Richard Bair"
       ],
       "tags": [
        "javafx"
       ]
      },
      {
       "id": 836,
       "title": "PhoneGap Essentials",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2072",
       "summary": "In this talk Brian will walk through the popular PhoneGap framework history, current status, and future directions. We'll then look at building a native mobile application using HTML, CSS, and JavaScript---all from a web browser.",
       "room": "Room 5",
       "speaker": "Brian Leroux",
       "day": "2012-11-14",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Brian Leroux"
       ],
       "tags": [
        "phonegap",
        "mobile"
       ]
      },
      {
       "id": 837,
       "title": "Engineering Elegance: The Secrets of Square's Stack",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2066",
       "summary": "In 2010, NY Times columnist David Pogue described Square as \"beautiful, simple and a joy to use.\" Square's dedication to user experience continues to strike a chord. Today, more than 2M merchants and individuals use Square to process $6B annually. \r\n\r\nHow does Square deliver its trademark seamlessness? Simple. By routinely tackling daunting engineering challenges, shielding merchants and payers alike from the inherent complexities of payment processing.\r\n\r\nBob takes the audience on a tour of Square's stack, tracing the payment lifecycle from end to end. From magnetic stripe decoding to multi-homed data centers, Bob talks about lessons learned–what worked and what didn't–and the variety of technologies and open source frameworks concealed behind Square's simple façade.",
       "room": "Room 4",
       "speaker": "Bob Lee",
       "day": "2012-11-14",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Bob Lee"
       ],
       "tags": [
        "javase"
       ]
      },
      {
       "id": 838,
       "title": "7 Things: How to make good teams great",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1595",
       "summary": "Developing a product over years is a tough job. It is hard for the team to stay excited on a day to day basis. So how can you improve motivation and innovation of agile teams and still keep the focus on building a great product?\r\n\r\nI want to share with you how we at Atlassian used an agile approach to become one of the most successful developer tool companies in the world. This talk will cover topics like FedEx days, 20-percent time, keeping distraction away from developers, lunchtime talks, dogfooding and much more.",
       "room": "Room 9",
       "speaker": "Sven Peters",
       "day": "2012-11-14",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Sven Peters"
       ],
       "tags": [
        "Atlassian",
        "collaboration"
       ]
      },
      {
       "id": 839,
       "title": "What's new with Google App Engine and Compute Engine?",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1784",
       "summary": "The PaaS pionnier is only getting better with time. With still with zero config required and best possible availability, a polyglot runtime, now EMEA datacenters, choice of NoSQL or SQL, a richer set of APIs and features (Full Text Search, Map Reduce, PageSpeed,...), come and taste the 2012 Grand Cru!\r\n\r\nWe'll also cover the newly announced Google Compute Engine and what it means to Appg Engine developers.",
       "room": "Room 6",
       "speaker": "Ludovic Champenois",
       "day": "2012-11-14",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Ludovic Champenois",
        "Alexis Moussine-pouchkine"
       ],
       "tags": [
        "javaee",
        "PAAS",
        "cloud"
       ]
      },
      {
       "id": 840,
       "title": "Securing the client side: Building safe web applications with HTML5",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1597",
       "summary": "HTML5 has changed the way we build and deploy code on the web, moving much of an application's logic from the server down to a user's browser, caching data locally via storage APIs, and delivering exciting experiences without touching the network. This has excellent effects on both speed and availability, but makes it more critical than ever to practice what we preach in terms of security best practices. This talk will outline some of the ways in which you can mitigate the effects of cross-site scripting and other attacks, ranging all the way from practical use of Content Security Policy to properly sandboxing user-generated content.",
       "room": "Room 7",
       "speaker": "Mike West",
       "day": "2012-11-14",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Mike West"
       ],
       "tags": [
        "HTML5",
        "security",
        "HTTP",
        "javascript"
       ]
      }
     ]
    },
    {
     "slot": "13:10",
     "talks": [
      {
       "id": 842,
       "title": "Testing Java Persistence Layer Done Right with Arquillian",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1558",
       "summary": "The Persistence Layer is one of the most crucial parts of enterprise applications, and we use many different frameworks and patterns to keep it clean.  We write sophisticated queries and use optimization techniques to give our end users the greatest possible experience. \r\n\r\nSo why is Persistence very often skipped in testing efforts? Is it really that complex and painful to setup? The Arquillian Persistence Extension removes that burden and boilerplate to make you a happy and productive programmer again!  Join this session and see for yourself that writing tests for your database logic is as easy as writing normal unit tests! Don't expect too many slides, be prepared for live demo!",
       "room": "Room 8",
       "speaker": "Bartosz Majsak",
       "day": "2012-11-14",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Bartosz Majsak"
       ],
       "tags": [
        "Testing",
        "javaee",
        "JPA"
       ]
      },
      {
       "id": 843,
       "title": "Application within Minutes",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1917",
       "summary": "This quickie will develop live a real life and useful collaborative web application in just a few minutes with the XWiki open source platform (http://xwiki.org).",
       "room": "Room 5",
       "speaker": "Vincent Massol",
       "day": "2012-11-14",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Vincent Massol"
       ],
       "tags": [
        "HTML",
        "javase",
        "web",
        "collaboration"
       ]
      },
      {
       "id": 844,
       "title": "Will you map/reduce my cloud?  My data's getting big. (part 1/2)",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2126",
       "summary": "So you think you're good at buzzword bingo?  Worse still, have a boss/manager/client who has more buzzwords than pragmatism?  This short series of sketches are a humorous and light-hearted look at the industry we love and make careers out of, with particular spotlight on the desperation often seen in the corporate world to be buzzword-compliant at any cost.",
       "room": "Room 4",
       "speaker": "Manik Surtani",
       "day": "2012-11-14",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Manik Surtani"
       ],
       "tags": [
        "MapReduce",
        "big data",
        "cloud"
       ]
      },
      {
       "id": 845,
       "title": "Building application components with monitoring in mind",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1569",
       "summary": "Application component builders want to provide their customers with visibility and monitoring capabilities by exposing KPIs.\r\nImagine your multi-tenant service uses popular open source software such as the Drools rule engine or Ehcache, \r\nand that you want to know the average firing time per tenant, or the cache hit/miss ratio per business use-case.\r\n\r\nThis talk will present a technique designed for component builders that transfers the control over the KPIs granularity to the products.",
       "room": "Room 9",
       "speaker": "Oded Peer",
       "day": "2012-11-14",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Oded Peer"
       ],
       "tags": [
        "patterns",
        "javase",
        "JMX"
       ]
      },
      {
       "id": 846,
       "title": "Docx4j - Generating Word and Excel files",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1777",
       "summary": "A lot of our customers want Word or Excel files for their reports. How often did you have to tell them that you couldn't create those files for them and that they would have to make do with PDF or CSV? But there really is no need for this, as there is a Java API that will help you create the requested file formats.\r\nIn this session I will show some examples of what you can do with the library.",
       "room": "Room 6",
       "speaker": "Linda Van der pal",
       "day": "2012-11-14",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Linda Van der pal"
       ],
       "tags": [
        "Excel"
       ]
      },
      {
       "id": 968,
       "title": "lightweight and reproducible environments with Vagrant and Puppet",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1659",
       "summary": "Many developers are in need of complex development- and test environments for different projects with customers. The ideal situation would be to have them running in a sandbox. With help of the Cloud and VMs it's possible to create those sandbox-environments but administration, configuration and maintenance cost a lot of time and money. \r\nWith a combination of Vagrant & Puppet it's possible to create and configure those environments \"on the fly\". Anytime, anywhere and above all reproducible.\r\nThe Talk shows how fast you can create and configure a sandbox for a Java environment including an Application Server and a database with the help of those tools.",
       "room": "Room 7",
       "speaker": "Hendrik Ebbers",
       "day": "2012-11-14",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Hendrik Ebbers"
       ],
       "tags": [
        "Testing",
        "Tools"
       ]
      }
     ]
    },
    {
     "slot": "13:35",
     "talks": [
      {
       "id": 967,
       "title": "Java Message Service 2.0 Update",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1989",
       "summary": "In this quickie talk we'll discuss the motivations for undertaking JSR343 Java Message Service 2.0 (the longest awaited update for JEE7!), it's current status as we head into public review and the future directions we expect to take. \r\nCome along and find out which new features will affect you and what the future holds for JMS going forwards.",
       "room": "Room 8",
       "speaker": "Nick Wright",
       "day": "2012-11-14",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Nick Wright"
       ],
       "tags": [
        "javaee",
        "JMS"
       ]
      },
      {
       "id": 969,
       "title": "mobile apps are a dead-end",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1980",
       "summary": "mobile apps have had a tremendous success and everyone still believes in their future. But if you take a look back at the fight desktop vs. web apps you can spot the similarities. \r\nMobile apps are an intermediate step while we are waiting for the mobile web to happen. The web already has won on the desktop and it will establish itself as the primary source of software for mobile devices eventually.\r\nThis talk will take a look at the past and will try to give a clear view of what is ahead for mobile software development and will introduce you to a future-proven way of building your mobile apps with phonegap.",
       "room": "Room 5",
       "speaker": "Daniel Kurka",
       "day": "2012-11-14",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Daniel Kurka"
       ],
       "tags": [
        "iPhone",
        "web",
        "mobile",
        "android"
       ]
      },
      {
       "id": 970,
       "title": "Will you map/reduce my cloud?  My data's getting big. (part 2/2)",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2127",
       "summary": "So you think you're good at buzzword bingo?  Worse still, have a boss/manager/client who has more buzzwords than pragmatism?  This short series of sketches are a humorous and light-hearted look at the industry we love and make careers out of, with particular spotlight on the desperation often seen in the corporate world to be buzzword-compliant at any cost.",
       "room": "Room 4",
       "speaker": "Manik Surtani",
       "day": "2012-11-14",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Manik Surtani"
       ],
       "tags": [
        "MapReduce",
        "big data",
        "cloud"
       ]
      },
      {
       "id": 971,
       "title": "Rocket propelled Java",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1852",
       "summary": "It's a well known fact that the Java language is verbose, probably more verbose than what it should be. In the past, developers have relied on external tools such as IDEs to cope with the verbosity level. But what if we were able to workaround the problem with the language itself? Come learn about AST transformations and how they can be applied to the Java language.",
       "room": "Room 9",
       "speaker": "Andres Almiray",
       "day": "2012-11-14",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Andres Almiray"
       ],
       "tags": [
        "javase",
        "lombok"
       ]
      },
      {
       "id": 972,
       "title": "Custom controls...nothing is impossible",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1567",
       "summary": "This quickie will give a short intro on custom controls, what they are and how to create one. As an example the story of a custom control (a splitflap control) will be shown, from the idea to the implementation in Java Swing, JavaFX 2.0 and HTML5 with a little demo of each control.",
       "room": "Room 6",
       "speaker": "Gerrit Grunwald",
       "day": "2012-11-14",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Gerrit Grunwald"
       ],
       "tags": [
        "javase",
        "HTML5",
        "javafx"
       ]
      },
      {
       "id": 973,
       "title": "Why Open Source Your Secrets",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1969",
       "summary": "As a business, it’s easy to see the benefits of using open source code - mostly because it’s free.  However, it’s often much more difficult to make a case for open sourcing code from your own money-making product or service.\r\n\r\nThis session gives three good business reasons for exposing your secrets to the outside world by open sourcing parts of your code base, and makes the case for giving back to the community as well as just utilising it.",
       "room": "Room 7",
       "speaker": "Trisha Gee",
       "day": "2012-11-14",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Trisha Gee"
       ],
       "tags": [
        "Methodology"
       ]
      }
     ]
    },
    {
     "slot": "14:00",
     "talks": [
      {
       "id": 847,
       "title": "Developing JAX-RS Web Applications Utilizing Server-Sent Events and WebSockets",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1985",
       "summary": "This hands-on lab guides attendees through building a Web application with the new JAX-RS 2.0 API. It shows how to use some value-added features of Jersey (the open source JAX-RS reference implementation) and Tyrus (the early draft implementation of Java API for WebSocket [JSR 356]) for leveraging HTML5 technologies such as server-sent events and WebSocket.\r\n\r\nAs part of the lab attendees will work on a single web application and a programmatic client. It will be split into 3 exercises: 1) Building a web application using JAX-RS - attendees will learn some of the new concepts in JAX-RS 2.0 and use them for building the web application (using pre-loaded code snippets) 2) Adding SSE and WebSocket support to the web application - attendees will learn how to extend the existing web application with bi-directional communication between the server and the client  3) Building a simple client - the attendees will learn the new JAX-RS 2.0 client api as well as the client-part of web socket and SSE support in Jersey.",
       "room": "BOF 1",
       "speaker": "Marek Potociar",
       "day": "2012-11-14",
       "from": "14:00",
       "to": "17:00",
       "type": "Hands-on Labs",
       "speakers": [
        "Marek Potociar",
        "Romain Grécourt",
        "Jitendra Kotamraju"
       ],
       "tags": [
        "HTML5",
        "Glassfish",
        "javaee"
       ]
      },
      {
       "id": 849,
       "title": "On the road to JDK 8: Lambda, parallel libraries, and more",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2124",
       "summary": "Lambda expressions and default methods are coming as significant language changes in JDK 8.  This session introduces the proposed language changes, summarizes the expected implementation technique using invokedynamic, and examines the planned parallel libraries exploiting new programming models made practical by lambdas.  The new parallel data libraries will offer Java developers efficient and powerful tools for building highly scalable concurrent applications that fully utilize modern multicore systems. In additional, this talk will given an overview of other new features coming in JDK 8 such as repeating annotations and annotations on types.",
       "room": "Room 8",
       "speaker": "Joe Darcy",
       "day": "2012-11-14",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Joe Darcy"
       ],
       "tags": [
        "javase",
        "JDK8",
        "Lambda"
       ]
      },
      {
       "id": 850,
       "title": "What's new with Android",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2059",
       "summary": "This is a developer-centric tour of what’s gone into the system and application frameworks since the last time we got together.",
       "room": "Room 5",
       "speaker": "Chet Haase",
       "day": "2012-11-14",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Chet Haase",
        "Romain Guy"
       ],
       "tags": [
        "animations",
        "mobile",
        "android"
       ]
      },
      {
       "id": 851,
       "title": "Home Automation for Geeks",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2075",
       "summary": "The term „Home Automation“ means to most people being able to switch lights and to control shutters with a smartphone. Many commercial offerings indeed do not provide much more than this. \r\n\r\nThe Open Source project openHAB takes you much further than that: While running on small and cheap embedded devices like the Raspberry Pi, you can explore the world of Home Automation beyond the ordinary: Do a presence simulation by the push of a button; see live charts of your sensor data or adjust your irrigation schedule through Google calendar. \r\n\r\nopenHAB is meant for Java and OSGi geeks: It comes with a powerful, Xbase-based scripting language, which allows to easily define every kind of automation logic you could possibly have in mind. Through its modular OSGi architecture it is furthermore very easily extendible, so that it can connect to a multitude of different systems. \r\n\r\nThis session introduces the core concepts behind openHAB and demonstrates its advanced features in a live environment.",
       "room": "Room 4",
       "speaker": "Kai Kreuzer",
       "day": "2012-11-14",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Kai Kreuzer",
        "Eichstädt-engelen Thomas"
       ],
       "tags": [
        "javase",
        "Domotics",
        "osgi"
       ]
      },
      {
       "id": 852,
       "title": "Eclipse: An Application Lifecycle Management Success Story",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1671",
       "summary": "With Hudson driving builds from the top; Git, Gerrit, Maven, and Tycho in the middle; and Mylyn controlling the pieces from the developer's desktop, The Eclipse Foundation provides an impressive stack of technologies for building software. All this great technology combined with governance, intellectual property management, architectural guidance, and coordination via the simultaneous release, combine to deliver an Application Lifecycle Management (ALM) solution that is the envy of other open source projects and IT departments around the globe. In this session, we'll present all the pieces and show how they work together; we'll talk about evolution of the our processes and infrastructure, and muse about how they'll grow in the future.",
       "room": "Room 9",
       "speaker": "Wayne Beaton",
       "day": "2012-11-14",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Wayne Beaton"
       ],
       "tags": [
        "Hudson",
        "mylyn",
        "Maven",
        "Eclipse",
        "ALM"
       ]
      },
      {
       "id": 853,
       "title": "Smart, Small, Connected: Java in the Internet of Things",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2105",
       "summary": "The \"Internet of Things\" is rapidly happening around us. By 2016, intelligent connected systems are predicted to outnumber mobile phones and personal computers combined and generate the majority of Internet traffic. Intelligent systems are the next frontier for reaching into the world to build new solutions, drive efficiencies, and create business opportunities on a huge scale across a wide range of markets such as healthcare, industrial automation, logistics, security, power distribution and consumption, environmental sensing, and much more.\r\n\r\nJava technology, with it's cross-platform, productive, and secure design, is already present in almost 10 billion devices around the globe. Oracle is working hard to ensure Java is best positioned to drive this next wave of embedded, connected, and ubiquitous computing. In this talk, learn about Oracle's vision for the \"Internet of Things\", and how we are working with the industry to advance embedded Java platforms and products to meet the challenges ahead.",
       "room": "Room 6",
       "speaker": "Terrence Barr",
       "day": "2012-11-14",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Terrence Barr"
       ],
       "tags": [
        "javase",
        "mobile",
        "J2ME"
       ]
      },
      {
       "id": 854,
       "title": "Using Java for robotics with Aldebaran's humanoid robot NAO",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2107",
       "summary": "Aldebaran Robotics is the world leader in humanoid robotics. Early 2012 the company released the latest version of the NAO robot – NAO Next Gen.\r\n\r\nNAO is a state-of-the-art humanoid robot with 25 degrees of freedom. It comes with a complete software suite and SDK to help users programming and interacting with the robot.\r\n\r\nIn this session, after introducing NAOqi (the programming framework used to program NAO), we will talk about the various ways you can program in java for NAO.\r\n\r\n* Choregraphe: a simple, grapical way to edit movements and   write behaviors\r\n\r\n* Using the Java SDK : how to access use NAOqi from Java.",
       "room": "Room 7",
       "speaker": "Dimitri Merejkowsky",
       "day": "2012-11-14",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Dimitri Merejkowsky"
       ],
       "tags": [
        "NAO",
        "robotics"
       ]
      }
     ]
    },
    {
     "slot": "15:10",
     "talks": [
      {
       "id": 856,
       "title": "Getting kids to code with Java and Greenfoot",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2125",
       "summary": "As software professionals, we are all aware of the importance of programming and computer science as skills for our discipline and society in general. We also know how important it is to get into contact with computing early in life to be able to make an informed career choice to go into the discipline. And thirdly, we know that many schools are not doing a great job in teaching computing to kids at the age where it really matters. (And this is, scarily, almost independent of the country you come from.)\r\n\r\nIn this talk we present Greenfoot, a Java-based educational programming environment for kids to learn object-oriented programming in an engaging way. With Greenfoot, kids from about 14 years upwards can create games and simulations in their first hour of contact, and quickly advance to interesting projects, including programming with Gamepads or the Kinect. We will present tools and teaching material that you can take directly into a school or programming club to get kids to start coding.",
       "room": "Room 3",
       "speaker": "Michael Kölling",
       "day": "2012-11-14",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Michael Kölling"
       ],
       "tags": [
        "javase",
        "children",
        "GreenFoot"
       ]
      },
      {
       "id": 857,
       "title": "Closures and Collections - the World After Eight",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2044",
       "summary": "The introduction of closures will bring new idioms to Java programming.  Collections in particular will be managed very differently, with stream-oriented processing and lazy evaluation becoming the norm for many applications.  Collections connected by these streams will offer new \"parallel views\" - implementations that will make optimal use of highly-concurrent hardware.  It's going to be a different world after Java8!",
       "room": "Room 8",
       "speaker": "Maurice Naftalin",
       "day": "2012-11-14",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Maurice Naftalin"
       ],
       "tags": [
        "closures",
        "JDK8",
        "collections"
       ]
      },
      {
       "id": 858,
       "title": "Vert.x",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2057",
       "summary": "Vert.x is the new polyglot asynchronous application framework for the JVM that enables you to write scalable asynchronous, web-enabled applications in JavaScript/CoffeeScript, Java, Ruby, Groovy and Python with ease.\r\n\r\nIn this talk Tim will be explaining why the growing number of internet enabled devices demand applications that can efficiently handles 10s if not 100s of thousands of concurrent connections, and how that leads us to an asynchronous application programming model.\r\n\r\nWe'll look at Vert.x's super simple simple concurrency model and we'll cover how to use the vert.x event bus to communicate between the components of your applications, including client side JavaScript\r\nrunning in the browser.\r\n\r\nProject website http://purplefox.github.com/vert.x/",
       "room": "Room 5",
       "speaker": "Tim Fox",
       "day": "2012-11-14",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Tim Fox"
       ],
       "tags": [
        "asynchronous",
        "polyglot"
       ]
      },
      {
       "id": 859,
       "title": "Robots That Care",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2074",
       "summary": "The past 50 years, robots where mostly found in factories where they for example assemble cars. The coming 50 years, more and more robots will enter our daily life to fulfill a wide range of applications: children will play with their robots and robots will help in the household. Robots will assist disabled persons. For example robotic prostheses will replace limbs for amputees or exoskeletons will facilitate the rehabilitation process to regain mobility. \r\n\r\n../..",
       "room": "Room 4",
       "speaker": "Bram Vanderborght",
       "day": "2012-11-14",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Bram Vanderborght"
       ],
       "tags": [
        "robotics"
       ]
      },
      {
       "id": 860,
       "title": "Behaviour Driven Development on the JVM - a State of the Union",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1494",
       "summary": "Behavior Driven Development (BDD) is an increasingly popular variation on Test Driven Development, which helps developers think more about what they are testing, in terms of \"executable specifications\" rather than conventional tests. But there are dozens of BDD tools for the JVM out there: how do you know what to use, and when? In this talk, we will look at the various BDD tools available for Java developers, both in Java and in other JVM languages. We will look at the pros and cons of the various tools, and learn which might be best suited for your team. Finally, you will discover the relationship between behavior driven development and automated acceptance testing, and why you probably need both.",
       "room": "Room 9",
       "speaker": "John Smart",
       "day": "2012-11-14",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "John Smart"
       ],
       "tags": [
        "agile"
       ]
      },
      {
       "id": 861,
       "title": "Developers - Prima Donnas of the 21st Century",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2117",
       "summary": "We are developers. We are creators. We are misunderstood by customers, by managers and even co-workers, we are undervalued and often overworked. People don't appreciate the value we put in our craft and and our drive for innovation. We are central to business in the 21st century yet people don't appreciate us! \" Of course you are, but you also forgot to mention: You suck at communication. You often put business at risk based on personal ambitions and waste serious amounts of time trying to improve and discuss the wrong things, all in the name of the next great thing that's going to solve it all. You've completely forgotten the plot! Don't believe me? Why don't you come along to this talk and get a wake up call. But don't expect to be treated nicely.",
       "room": "Room 6",
       "speaker": "Hadi Hariri",
       "day": "2012-11-14",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Hadi Hariri"
       ],
       "tags": [
        "Methodology"
       ]
      },
      {
       "id": 862,
       "title": "Android Burning Questions",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1993",
       "summary": "Everything You Always Wanted to Know About Android* \r\n(*But Were Afraid to Ask)\r\n\r\nThis talk is collection of various topics that tends to be a popular subject any time Android development is discussed. The bulk of the presentation will deal with effective ways to build UI on Android, being a sequel to \"Programatic UI - how to build UI and avoid acute chevronitis\" talk, presented at Devoxx 2010, but other areas, such as security model and application life-cycle gets sifted through.\r\nWhile some of the methods presented won't be exactly what creators of Android had in mind, the focus is to behave correctly, be reusable and extensible and how to make best of the techniques Java gives us to cope with whatever shortcomings Android might have.\r\nIf you love programming in Java and have concerns that this language is somewhat second-class citizen to XML on Android platform, this talk is right for you.",
       "room": "Room 7",
       "speaker": "Pavel Lahoda",
       "day": "2012-11-14",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Pavel Lahoda"
       ],
       "tags": [
        "patterns",
        "performance",
        "mobile",
        "android"
       ]
      }
     ]
    },
    {
     "slot": "16:40",
     "talks": [
      {
       "id": 865,
       "title": "Fork / Join, lambda & parallel() : parallel computing made (too ?) easy",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1702",
       "summary": "The emergence of these new language features and its API began in Java 7 with the Fork / Join framework. It\r\nwill continue in Java 8, at which point we will be able to to fully utilize the resources of our multicore processors, with a minimum of effort.\r\n\r\nWhat are those new patterns ? What performance gains can we expect ? What are the new bugs that we'll surely meet ? One hour to respond specifically to these three questions, demystifying things, and most importantly, introducing new problems and solutions. An hour to understand how our habits of concurrent programming will have to evolve, and what concurrent programming will look like tomorrow.",
       "room": "Room 8",
       "speaker": "José Paumard",
       "day": "2012-11-14",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "José Paumard"
       ],
       "tags": [
        "multicore",
        "JDK8"
       ]
      },
      {
       "id": 866,
       "title": "Putting the App back into Web Apps : Building the modern web with Dart",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1490",
       "summary": "Dart is more than a new structured web programming language. Dart's tools, libraries, and editor help developers from all platforms build complex, high performance web apps. This is a practical session, highlighting Dart's implementation of Web Components. Best of all, we'll show you how to run these Dart apps today across the entire modern web with our compiler to JavaScript.",
       "room": "Room 5",
       "speaker": "Seth Ladd",
       "day": "2012-11-14",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Seth Ladd"
       ],
       "tags": [
        "HTML5",
        "web",
        "dart"
       ]
      },
      {
       "id": 867,
       "title": "Do you like coffee with your dessert?  Java and the Raspberry Pi",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1602",
       "summary": "The Raspberry Pi has caused a huge wave of interest amongst developers, providing an ARM powered single board computer running a full Linux distro off an SD card and all for only $35!  \r\n\r\nThis session will look at how Java can be used on a device like this.  Using Java SE for embedded devices and a port of JavaFX we will show a variety of demonstrations of what the Raspberry Pi is capable of.  The Raspberry Pi also provides GPIO line access and we’ll cover how these can be used from Java applications.  Prepare to be amazed at what this tiny board can do.",
       "room": "Room 4",
       "speaker": "Simon Ritter",
       "day": "2012-11-14",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Simon Ritter"
       ],
       "tags": [
        "javafx",
        "javase"
       ]
      },
      {
       "id": 868,
       "title": "Architecture All the Way Down",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2078",
       "summary": "A little old lady once challenged a well-known scientist’s explanation on the structure of the universe, countering that the world is really a flat plate supported on the back of a giant tortoise. The scientist rebutted the little old lady’s challenge with one of his own by asking what the tortoise was standing on. The little old lady’s sly reply was that it’s, “turtles all the way down.” So too is software architecture “turtles all the way down”. In this session, we cover a broad range of topics that challenge traditional practices of software architecture, examining what it takes to bring down the ivory tower, probing the paradoxical aspects of architecture’s goal, investigating the inextricable link between temporal decisions and structural flexibility, and exploring the roles of SOA, modularity, and software design principles and patterns. From the highest level applications and services to the code that exists in the bowels of the system, we explore architecture all the way down.",
       "room": "Room 9",
       "speaker": "Kirk Knoernschild",
       "day": "2012-11-14",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Kirk Knoernschild"
       ],
       "tags": [
        "javase",
        "Methodology",
        "osgi"
       ]
      },
      {
       "id": 869,
       "title": "Mobile Applications Development Lifecycle",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2116",
       "summary": "This presentation will provide a hands-on \"live\" demonstration on how to manage Mobile Applications development and release life cycle using IBM tools.\r\n\r\nMany developers thinks IBM tools are fat and complex.  IBM recognized this and now provides a full family of lightweight, developer friendly tools to develop applications, manage their release life cycle and deploy applications on lightweight application servers.\r\n\r\nThe demonstration will show you a real-life developer's workflow, from issue identification and reporting, to application release in the context of a Mobile hybrid application and REST based backend web services.\r\n\r\nWe commit to deliver a technical presentation and demonstration, using maximum 10 slides, no marketing stuffs.\r\n\r\nTools Used : Rational Team Concert (RTC), IBM Worklight and WebSphere Application Server Liberty profile",
       "room": "Room 6",
       "speaker": "Eric Cattoir",
       "day": "2012-11-14",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Eric Cattoir",
        "Sébastien Stormacq"
       ],
       "tags": [
        "ibm",
        "mobile",
        "Tools"
       ]
      },
      {
       "id": 870,
       "title": "Defensible Development with Secure HTTP Headers",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1570",
       "summary": "To address security defects developers typically resort to fixing design flaws and security bugs directly in the code. Finding and fixing security defects can be a slow, painstaking, and expensive process. While development teams work to incorporate security into their development processes, issues like Cross-Site Scripting (XSS), Session Hijacking, and Clickjacking continue to plague many commonly used applications. See how these vulnerabilities actually work and see live demos showing how secure HTTP headers can be used to mitigate common attacks. Developers and architects will learn how to use the latest secure HTTP headers to proactively prevent attacks from occurring and stop hackers from exploiting their applications.",
       "room": "Room 7",
       "speaker": "Frank Kim",
       "day": "2012-11-14",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Frank Kim"
       ],
       "tags": [
        "security",
        "web"
       ]
      }
     ]
    },
    {
     "slot": "17:50",
     "talks": [
      {
       "id": 872,
       "title": "Service Versioning in SOA and Cloud",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1775",
       "summary": "Keeping versioning under control is essential in the success of a SOA. However, there are no industry standards for service versioning, thus leaving the responsibility of implementing a service versioning system up to the architects and developers within the IT enterprise. \r\n\r\nWe often see design-type versioning, resulting in Big Bang governance strategies. A runtime versioning strategy may be, in fact, be preferable.\r\n\r\nEvery change must be built, and every change must be governed. A \"cheap\" build may lead to a large governance impact. But conversely, a small governance cost may lead to a large build impact. Both build and governance costs need to be taken into account and carefully balanced when choosing and implementing a service versioning strategy.",
       "room": "Room 3",
       "speaker": "Ignaz Wanders",
       "day": "2012-11-14",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Ignaz Wanders"
       ],
       "tags": [
        "SOA"
       ]
      },
      {
       "id": 873,
       "title": "Security vulnerabilities in Java SE",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2111",
       "summary": "This talk will present the results of our security research project which has lead to the discovery of 50 security vulnerabilities in Java implementations coming from Oracle, IBM and Apple. The primary goal of the talk is to twist your mind and show you how challenging and tricky Java security can be.\r\n\r\nDuring the talk, certain key details pertaining to Java VM security model and its operation will be presented. This will be followed by a detailed discussion of certain problems related to Java SE security.\r\n\r\nThe talk will disclose the methodology taken and technical information of several sample (most interesting) vulnerabilities found during our research. This will include information about the critical issue found recently and affecting all Java SE versions 5, 6 and 7 provided that the weakness will be fixed by the time of a conference.\r\n\r\nAlong with that, the talk will disclose several previously unpublished exploitation techniques allowing for a complete Java VM security sandbox escape.",
       "room": "Room 8",
       "speaker": "Adam Gowdiak",
       "day": "2012-11-14",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Adam Gowdiak"
       ],
       "tags": [
        "security",
        "javase"
       ]
      },
      {
       "id": 874,
       "title": "The Chrome Dev Tools can do THAT",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1791",
       "summary": "Your browser is one of the most and best instrumented development platforms - you may just not realize it yet. Of course, you can inspect the source, walk the DOM, fiddle with the CSS, and even evaluate some Javascript expressions, but there is so much more! There are dozens of power tools at your disposal:\r\n\r\n- Remote debugging capabilities (hint: debug your mobile apps on your desktop)\r\n- Powerful JavaScript debugger and profiler\r\n- CPU, memory, CSS layout and GPU profilers\r\n- Built-in network monitoring tools: monitor at socket level\r\n- SourceMaps, pretty print, revision control and autosave\r\n- Data export and import: HAR, timeline, snapshots\r\n- Custom extensions, customizable stylesheets, and so much more..\r\n\r\nThere is nothing more important than having great tools and visibility into where your performance bottlenecks are, as well as to help you debug those gnarly bugs. Come by and learn about all the great capabilities of Chrome Dev Tools!",
       "room": "Room 5",
       "speaker": "Ilya Grigorik",
       "day": "2012-11-14",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Ilya Grigorik"
       ],
       "tags": [
        "HTML5",
        "Chrome",
        "Tools"
       ]
      },
      {
       "id": 875,
       "title": "NFC, Arduino, Raspberry PI, Android and NodsJS Case-Study",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2083",
       "summary": "This secret project will get announced at Devoxx.  What we can tell you is that we've found an interesting use-case where NFC tags, Arduino, Raspberry PI, Android and NodeJS are used together... crazy stuff  :)",
       "room": "Room 4",
       "speaker": "Gert Leenders",
       "day": "2012-11-14",
       "from": "17:50",
       "to": "19:20",
       "type": "Conference",
       "speakers": [
        "Gert Leenders",
        "Stijn Van den enden",
        "Hans Cappelle",
        "Alex Van boxel",
        "Sam Buls"
       ],
       "tags": [
        "RaspberryPI",
        "android",
        "arduino",
        "NFC",
        "NodeJS"
       ]
      },
      {
       "id": 876,
       "title": "Agile ++: When Agile Goes Well",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1971",
       "summary": "LMAX might be famous for having created one of the fastest intra-thread messaging frameworks around.  You might even know that we literally wrote the book on Continuous Delivery.  But none of that answers the question of how we actually do what we do.\r\n\r\nAgile from the beginning, the technology team took a lot of ideas from places like ThoughtWorks and grew, adapted and changed them until they became a hybrid monster of agile.  And guess what?  It actually works.\r\n\r\nWe’ll talk you through the agile processes and tools we use; we’ll cover how we got to where we are today; we’ll give examples of what does and does not work for us, and we’ll show how agile has spread well beyond the technology team and into the whole business.\r\n\r\nThis session is for anyone interested in agile methodologies.  It shows:\r\n - What a dedicated investment in agile can give your organisation\r\n - How you can evolve your current agile processes\r\n - What challenges still face those who are “doing agile” effectively.",
       "room": "Room 9",
       "speaker": "Trisha Gee",
       "day": "2012-11-14",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Trisha Gee",
        "Israel Boza rodriguez"
       ],
       "tags": [
        "scrum",
        "agile"
       ]
      },
      {
       "id": 877,
       "title": "Effective Scala",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1922",
       "summary": "This talk covers best practices of using the Scala language on the JVM.  In this session, hear how to avoid null pointer exceptions, what the use of traits implies on object oriented design and how to best interface Java and Scala programs.  This talk promotes general best practices in Scala, as exemplified in the book: Scala In Depth.",
       "room": "Room 6",
       "speaker": "Joshua Suereth",
       "day": "2012-11-14",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Joshua Suereth"
       ],
       "tags": [
        "patterns",
        "scala"
       ]
      },
      {
       "id": 878,
       "title": "Having fun with Android mashups",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1811",
       "summary": "Mashup is a combination of information and services from two unrelated sources, for example showing photos from Flickr on a map from OpenStreetMap. In this presentation we take the mashup one step further by combining rich Android user interfaces with different components and services available on the web, in order to create amazing programs that blur the line between application and web content.\r\n\r\nThe audience will learn how to load data from different sources, how to show web content in an Android application, and how to set up two-way communications between the Android application and JavaScript code in the web view.",
       "room": "Room 7",
       "speaker": "Pär Sikö",
       "day": "2012-11-14",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Pär Sikö",
        "Martin Gunnarsson"
       ],
       "tags": [
        "android"
       ]
      }
     ]
    },
    {
     "slot": "19:00",
     "talks": [
      {
       "id": 880,
       "title": "JDK 7 Updates: Director's Cut",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1543",
       "summary": "In this talk you'll learn how the JDK 7 Updates Project in OpenJDK works, and how to work within it, how to track changes, get your fixes in, and follow along as for example the Mac OS X Port gets integrated into future JDK 7 update releases.\r\n\r\nIf you are curious what kind of fixes are encouraged for JDK 7 Updates, what it takes to become a Committer or Reviewer on this Project, how the community contributes to it, and what to expect in upcoming JDK 7 Update releases, then this talk is for you. If you'd like to understand how JDK 7 Updates make their way into Linux distributions, then this talk is for you. If you'd like to know how fixes from HotSpot, JAXP, JAXB, JDK 8, etc. get integrated into JDK 7 Updates, then this talk is for you.",
       "room": "BOF 1",
       "speaker": "Dalibor Topic",
       "day": "2012-11-14",
       "from": "19:00",
       "to": "20:00",
       "type": "BOF",
       "speakers": [
        "Dalibor Topic"
       ],
       "tags": [
        "javase",
        "JDK",
        "openjdk"
       ]
      },
      {
       "id": 881,
       "title": "Java EE Gathering",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1617",
       "summary": "Informal meeting with Java EE spec. leads and enthusiasts",
       "room": "BOF 2",
       "speaker": "David Delabassee",
       "day": "2012-11-14",
       "from": "19:00",
       "to": "20:00",
       "type": "BOF",
       "speakers": [
        "David Delabassee",
        "Markus Eisele"
       ],
       "tags": [
        "javaee",
        "Servlet",
        "JMS",
        "CDI",
        "JAX-RS",
        "EJB3"
       ]
      }
     ]
    },
    {
     "slot": "20:00",
     "talks": [
      {
       "id": 882,
       "title": "OpenJDK Community Update",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1579",
       "summary": "Get into the latest news and discussions of OpenJDK. We'll gather who's who of OpenJDK visiting Devoxx to drive the discussion and and try to answer your questions. Full-blown OpenJDK committers and happy enthusiasts - everyone are welcome to this session!",
       "room": "BOF 1",
       "speaker": "Cecilia Borg",
       "day": "2012-11-14",
       "from": "20:00",
       "to": "21:00",
       "type": "BOF",
       "speakers": [
        "Cecilia Borg"
       ],
       "tags": [
        "javase",
        "JDK",
        "openjdk"
       ]
      },
      {
       "id": 883,
       "title": "Building a Clojure Google+ Client Library",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1840",
       "summary": "Clojure is an exciting new JVM hosted language based on LISP, with a fundamental emphasis on concurrency and expressiveness. In this talk we will take a practical look at using and working with Clojure in the real world examining the development of the new Clojure client for Google APIs, the challenges we faced in providing a consistent and expressive experience, and the benefits Clojure brings for library and application developers.",
       "room": "BOF 2",
       "speaker": "Ian Barber",
       "day": "2012-11-14",
       "from": "20:00",
       "to": "21:00",
       "type": "BOF",
       "speakers": [
        "Ian Barber"
       ],
       "tags": [
        "google"
       ]
      }
     ]
    },
    {
     "slot": "21:00",
     "talks": [
      {
       "id": 884,
       "title": "Adopt OpenJDK and Adopt a JSR",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1710",
       "summary": "This BOF will cover the two JUG lead programs to gain more developer involvement in Java standards as well as the language and the platform itself.  A couple of quick presentations will be followed by lots of practical advice on how to get you and/or your organisation started.  Of course a free for all Q&A will be encouraged at the end!",
       "room": "BOF 1",
       "speaker": "Martijn Verburg",
       "day": "2012-11-14",
       "from": "21:00",
       "to": "22:00",
       "type": "BOF",
       "speakers": [
        "Martijn Verburg"
       ],
       "tags": [
        "javase",
        "JUG",
        "javaee",
        "jcp",
        "openjdk",
        "javame"
       ]
      },
      {
       "id": 885,
       "title": "The next evolution of apps with Chrome",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2048",
       "summary": "Chrome Packaged Apps are evolving to do more: work seamlessly offline, give developers more control of their user interface and allow direct access to the users device hardware. Join Paul Kinlan for a dive into the next evolution of Chrome Apps and learn how you can start doing things you never thought possible using web technologies. See also \r\nhttp://developer.chrome.com/trunk/apps/about_apps.html",
       "room": "BOF 2",
       "speaker": "Paul Kinlan",
       "day": "2012-11-14",
       "from": "21:00",
       "to": "22:00",
       "type": "BOF",
       "speakers": [
        "Paul Kinlan"
       ],
       "tags": [
        "web",
        "javascript",
        "Chrome"
       ]
      }
     ]
    }
   ]
  },
  {
   "day": "2012-11-15",
   "slots": [
    {
     "slot": "09:40",
     "talks": [
      {
       "id": 887,
       "title": "Google Keynote",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2065",
       "summary": "TBA",
       "room": "Room 8",
       "speaker": "Tim Bray",
       "day": "2012-11-15",
       "from": "09:40",
       "to": "10:30",
       "type": "Conference",
       "speakers": [
        "Tim Bray"
       ],
       "tags": [
        "android",
        "mobile"
       ]
      }
     ]
    },
    {
     "slot": "10:50",
     "talks": [
      {
       "id": 888,
       "title": "Effective Dependency Injection",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1616",
       "summary": "Most literature around dependency injection concentrate on teaching the basics of inversion of control with emphasis on the mechanisms. Very few resources explain how to use these mechanisms effectively (recipes) and in particular how to refactor existing code into well defined modules with properly defined external APIs, implementation bindings and documented dependencies. \r\n\r\nIn this talk, we propose to show design patterns we encountered when refactoring existing code to use effectively the powers of Dependency Injection. \r\n\r\nExamples :\r\n\t- Contract/Service paradigm : define your APIs, hide your implementation, use Binding to publish.\r\n\t- The @Named code smell.\r\n\t- Use BindingAnnotations when multiple implementation exists\r\n\t- The disappearance of the Context object\r\n\t- Use Scoping everywhere. \r\n\t- Use Explicit Binding unless you support plugins/runtime extensibility.\r\n\r\nWe expect to show around 10~15 recipes with actual code demonstrating the patterns and anti-patterns",
       "room": "Room 3",
       "speaker": "Jerome Dochez",
       "day": "2012-11-15",
       "from": "10:50",
       "to": "11:50",
       "type": "Conference",
       "speakers": [
        "Jerome Dochez",
        "Nicholas Behrens"
       ],
       "tags": [
        "guice",
        "javaee",
        "CDI"
       ]
      },
      {
       "id": 889,
       "title": "Bean Validation 1.1: it's not Beansland anymore",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1994",
       "summary": "Bean Validation standardizes constraint declarations and validation for the Java platform.Bean Validation 1.0 has been widely adopted and seamlessly integrated with some other JSRs (like JSF, JPA) and the rich Java framework environment at large.\r\n\r\nWe will explore what version 1.1 brings to the table and what new features you can expect for your future Java SE or EE applications. We will discuss in an example driven fashion method-level validation, Context and Dependency Injection (CDI) integration and many more new features and improvements.\r\n\r\nCome join us to see that Bean Validation is not Beansland anymore.",
       "room": "Room 8",
       "speaker": "Emmanuel Bernard",
       "day": "2012-11-15",
       "from": "10:50",
       "to": "11:50",
       "type": "Conference",
       "speakers": [
        "Emmanuel Bernard"
       ],
       "tags": [
        "javaee",
        "Hibernate"
       ]
      },
      {
       "id": 890,
       "title": "Fast UIs for the mobile web",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2045",
       "summary": "One of the great features of the modern web is that sites work on any device with a browser. This session will focus on creating UIs for the cross-device web. We will cover building web sites that support multiple device form factors (responsive and non-responsive approaches), discuss single page sites and some of the layout features in modern mobile browsers and do a deep dive into multi-touch input on the web. Finally, we'll show some of the awesome new mobile debugging tools in Chrome and Chrome for Android to make your mobile websites super fast.\r\nOutline :\r\n- Supporting multiple devices\r\n- Building fast single page UIs\r\n- Multi-touch input\r\n- Mobile web development flow",
       "room": "Room 5",
       "speaker": "Sam Dutton",
       "day": "2012-11-15",
       "from": "10:50",
       "to": "11:50",
       "type": "Conference",
       "speakers": [
        "Sam Dutton"
       ],
       "tags": [
        "web",
        "mobile",
        "Tools"
       ]
      },
      {
       "id": 891,
       "title": "The JBoss Polyglot Revolution - Be part of it!",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1978",
       "summary": "In this talk, Galder will look at the evolution of JBoss, from a producer of java based middleware, to the current expansion towards multi-language platforms. How did Torquebox come about? Why are we creating Ceylon? What is Escalante? What is Immutant? This and many other questions will be answered in this informal chat that will not only look into the motivations behind building middleware in other languages, but will also discuss the technological advances that have this expansion possible. During this presentation the audience will get invaluable feedback on the lessons learnt while developing with other languages, pitfalls of the different languages used, tips of learning new languages...etc, giving them first-hand advice that they will be able to apply in their work environments. Finally, the talk will finish with information on how join and contribute to the JBoss Polyglot Revolution!",
       "room": "Room 4",
       "speaker": "Galder Zamarreño",
       "day": "2012-11-15",
       "from": "10:50",
       "to": "11:50",
       "type": "Conference",
       "speakers": [
        "Galder Zamarreño"
       ],
       "tags": [
        "scala",
        "polyglot",
        "Clojure",
        "Ceylon",
        "jboss"
       ]
      },
      {
       "id": 892,
       "title": "How to build Big Data Pipelines for Hadoop using OSS",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1565",
       "summary": "Hadoop is not an island. To deliver a complete Big Data solution, a data pipeline needs to be developed that incorporates and orchestrates many diverse technologies.\r\n\r\nA Hadoop focused data pipeline not only needs to coordinate the running of multiple Hadoop jobs (MapReduce, Hive, Pig or Cascading), but also encompass real-time data acquisition and the analysis of reduced data sets extracted into relational/NoSQL databases or dedicated analytical engines.\r\n\r\nUsing an example of real-time event processing (Twitter), in this session we will demonstrate how to build manageable and robust pipeline solutions around BigData using Open Source software such as Apache Hadoop, Cascading, Spring Batch & Integration and Redis.",
       "room": "Room 9",
       "speaker": "Costin Leau",
       "day": "2012-11-15",
       "from": "10:50",
       "to": "11:50",
       "type": "Conference",
       "speakers": [
        "Costin Leau"
       ],
       "tags": [
        "MapReduce",
        "Redis",
        "Hadoop"
       ]
      },
      {
       "id": 893,
       "title": "Unitils : Full stack testing solution for enterpise applications",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2122",
       "summary": "Automated testing is the key to developing high quality software and maintainable codebases. How can we automate testing when data and database schemes are constantly evolving? How can we test infrastructure related components like automated e-mails without actually sending them? How can we test webapps, webservices, systems integration, I/O, database transactions… and still keep our head together?\r\n\r\nUnitils is an open source test framework aimed at making unit testing fast and easy. This talk will explain how we can use Unitils and extend it to facilitate integration and system testing, resulting in a set of reusable modules that reduce boilerplate code to a minimum, making the test readable and maintainable. We’ll cover some of the most common testing problems and how Unitils gives us a solution.",
       "room": "Room 6",
       "speaker": "Thomas De rycke",
       "day": "2012-11-15",
       "from": "10:50",
       "to": "11:50",
       "type": "Conference",
       "speakers": [
        "Thomas De rycke",
        "Jeroen Horemans"
       ],
       "tags": [
        "Testing",
        "javaee",
        "Tools"
       ]
      },
      {
       "id": 894,
       "title": "G1 Garbage Collector - Big Heaps and Low Pauses",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2039",
       "summary": "The Garbage-First (G1) is the latest garbage collector in the JVM, aiming to be the long-term replacement for CMS. Targeted for machines with large memories and multiple processors. Promising low and more predictable pause times while achieving high throughput. \r\n\r\nThe session will introduce the architecture and design of G1. Then the main focus of the talk  will be the performance characteristics observed under different loads; tuning capabilities and common pitfalls. With the aim of answering the question can you run big heaps and achieve low pauses.",
       "room": "Room 7",
       "speaker": "Jaromir Hamala",
       "day": "2012-11-15",
       "from": "10:50",
       "to": "11:50",
       "type": "Conference",
       "speakers": [
        "Jaromir Hamala"
       ],
       "tags": [
        "performance",
        "JVM"
       ]
      }
     ]
    },
    {
     "slot": "12:00",
     "talks": [
      {
       "id": 896,
       "title": "The JCP program: More that 101 ways to influence the future of the Java Platform",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2123",
       "summary": "The JCP plays a critical role in the evolution of Java. This session will explain how the JCP is structured and how Java Specifications or JSRs are developed.  The session will emphasize the value of transparency and participation through the JCP, Java User Groups and the Adopt-a-JSR program. We will also explore some upcoming changes to the process, and explain how you can get involved. Bring your questions, your suggestions, and your concerns. We want to hear from you, and to encourage and enable your active participation in the advancement of the Java platform.",
       "room": "Room 3",
       "speaker": "Patrick Curran",
       "day": "2012-11-15",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Patrick Curran",
        "Heather Vancura"
       ],
       "tags": [
        "javase",
        "jcp",
        "javaee",
        "JSR"
       ]
      },
      {
       "id": 897,
       "title": "The Evolution of Java Persistence",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1951",
       "summary": "The data access requirements of today’s Java applications keep expanding and have grown to include features such as tenant data isolation for cloud deployment, extensible models to support per tenant customization, JSON binding for RESTful web services, the ability to store Java objects in NoSQL databases and more. EclipseLink is well known as an object-relational mapping framework and as the JPA 2.0 reference implementation in Java EE 6, but it continues to evolve and now provides a comprehensive set of data services for Java developers building enterprise and cloud applications in Java EE and SE.  In this session we’ll dive into these new services and build an application that goes from mobile device to back end storage leveraging EclipseLink both in the back end for data persistence and on the front end for JSON over REST to support HTML5 clients.",
       "room": "Room 8",
       "speaker": "Shaun Smith",
       "day": "2012-11-15",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Shaun Smith"
       ],
       "tags": [
        "EclipseLink",
        "JPA2",
        "HTML5",
        "REST",
        "JSON",
        "JAX-RS",
        "NoSQL"
       ]
      },
      {
       "id": 898,
       "title": "For Butter or Worse",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2058",
       "summary": "tba",
       "room": "Room 5",
       "speaker": "Chet Haase",
       "day": "2012-11-15",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Chet Haase",
        "Romain Guy"
       ],
       "tags": [
        "android",
        "mobile"
       ]
      },
      {
       "id": 899,
       "title": "Vaadin 7",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1724",
       "summary": "Vaadin Framework version 7 is the first new major version of the popular rich web framework in over three years of iterative evolution. It includes Google Web Toolkit (GWT) to provide best of the Java based UI development - both of the server and client-side. The presentation describes the new features and design decisions and explains the implications of including GWT.\r\n\r\nThe first goal for Vaadin 7 is to give more freedom to use underlying technologies with ease. We'll show through examples on how to utilize new API:s. The second goal is to embrace the extensibility of the framework with new APIs for adding features. Final goal of the release is to clean up the API. We show what have been changed, how the changes may break your application and give advice on how to upgrade to Vaadin 7.",
       "room": "Room 4",
       "speaker": "Joonas Lehtinen",
       "day": "2012-11-15",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Joonas Lehtinen"
       ],
       "tags": [
        "web",
        "GWT",
        "vaadin"
       ]
      },
      {
       "id": 900,
       "title": "OAuth 2 and Identity",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2069",
       "summary": "This presentation starts with a quick introductory course in how OAuth 2 works: Flows, tokens, secrets, and the rest.  We’ll take a side-trip into OpenID Connect, which relies on OAuth 2.  All this will unfortunately require a little bit of discussion of the history and politics. Finally, we’ll look at some OAuth2 APIs, both server-side and client-side, as an example of how this feels to an actual developer.",
       "room": "Room 9",
       "speaker": "Tim Bray",
       "day": "2012-11-15",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Tim Bray",
        "Nicolas Garnier"
       ],
       "tags": [
        "OAuth",
        "security"
       ]
      },
      {
       "id": 902,
       "title": "Modern Software Development Anti-Patterns",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1709",
       "summary": "The Diabolical Developer and Ben Evans (the voice of reason!) return with a full length presentation of modern software development anti-patterns. This session provides a wealth of tips and tricks to free you from the chains of so call ‘modern software development best practices’.\r\n\r\nWe’re not delivering software any more successfully than our forebears! So what’s really going on? Well things like Agile and Software craftsmanship certainly take you down some dangerous paths, and don’t even get us started on Java 7! You’ll learn about topics such as how to unleash the awesome power of:\r\n\r\n* Mortgage Driven Development\r\n* Turtles All The Way Down\r\n* Conference Driven Delivery\r\n* Unleash the awesome power of the FactoryFactoryManagerBuilder",
       "room": "Room 7",
       "speaker": "Martijn Verburg",
       "day": "2012-11-15",
       "from": "12:00",
       "to": "13:00",
       "type": "Conference",
       "speakers": [
        "Martijn Verburg",
        "Ben Evans"
       ],
       "tags": [
        "patterns",
        "javase",
        "javaee",
        "Methodology",
        "agile"
       ]
      }
     ]
    },
    {
     "slot": "13:10",
     "talks": [
      {
       "id": 904,
       "title": "Do you REST Assured?",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1578",
       "summary": "Today it's easy to expose services as REST/HTTP with frameworks like Jersey and Spring but validating that the server actually behaves as expected can be cumbersome in Java. REST Assured is an open source Java DSL that allows you to avoid boiler-plate code to make requests and validate even complex responses in a simple manner. Come and see how easily you can validate e.g. XML and JSON payloads by making use of Groovy data structures and closures from Java using a simple BDD-like syntax. It also comes with support for popular authentication schemes, integrates flawlessly with JUnit and TestNG and much more. Testing and validating REST services in Java cannot be much simpler!",
       "room": "Room 8",
       "speaker": "Johan Haleby",
       "day": "2012-11-15",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Johan Haleby"
       ],
       "tags": [
        "javase",
        "Testing",
        "REST",
        "HTTP"
       ]
      },
      {
       "id": 905,
       "title": "Practical guide to Infinispan Queries",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2034",
       "summary": "Infinispan is a powerful and extremely efficient transactional NoSQL: a distributed in-memory Data Grid exposing primarily a Map-like API, but also integrating Apache Lucene to allow full-text queries. This integration however can be setup in a number of ways, resulting in different architectures.\r\n\r\nHow to pick the right clustering mode? Which indexing backend to choose? Should you use a shared CacheLoader?\r\n\r\nLet’s explore these options via some practical examples.",
       "room": "Room 5",
       "speaker": "Sanne Grinovero",
       "day": "2012-11-15",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Sanne Grinovero"
       ],
       "tags": [
        "clusters",
        "Infinispan",
        "search",
        "cloud"
       ]
      },
      {
       "id": 906,
       "title": "The Future of Software Development Process Methodology Effectiveness (Part 1/2)",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2113",
       "summary": "A short history, overview, and future of software development process.\r\nDo you have enough process in your process?\r\nNo: You can *never* have enough process.\r\nSo hire someone expensive to help you out.\r\nIn the meantime, come to this talk and find out what it's all about, with charts, graphs, and bullet points for enhanced effectiveness.",
       "room": "Room 4",
       "speaker": "Chet haase Software process methodologist",
       "day": "2012-11-15",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Chet haase Software process methodologist"
       ],
       "tags": [
        "Methodology",
        "FunctionalProgramming",
        "agile"
       ]
      },
      {
       "id": 907,
       "title": "From Zero to JavaEE in 15 Minutes (or Less)",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1910",
       "summary": "What if somebody told you that you have to reverse engineer a database and to create a JSF application with CRUD operations for it? What if he adds that he needs this application deployed in the cloud and that moreover you only have 15 minutes to achieve this? Wouldn't you think this person is out of his mind? During this quickie we will show you how to do this using JBoss Forge.",
       "room": "Room 9",
       "speaker": "Koen Aers",
       "day": "2012-11-15",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Koen Aers"
       ],
       "tags": [
        "javaee"
       ]
      },
      {
       "id": 908,
       "title": "The Cloud Foundry Quickie: 10 minutes from Concept to Deployment",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2053",
       "summary": "Isn't life hard enough without deployment troubles? Isn't life hard enough as a new engineer on a team without reproducible builds and environments? Join Josh Long as he introduces Cloud Foundry, the open source PaaS from VMWare. Learn why Cloud Foundry makes life easier for everybody - operations people and developers-alike - in this Cloud Found Quickie",
       "room": "Room 6",
       "speaker": "Josh Long",
       "day": "2012-11-15",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Josh Long"
       ],
       "tags": [
        "CloudFoundry",
        "PAAS",
        "cloud"
       ]
      },
      {
       "id": 974,
       "title": "The advantage of Using Rest API’s in Portal Platforms to extend the reach of the portal.",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1696",
       "summary": "While JSR-311 is part of J2EE6, we decided to use it within our OS Portal platform Entando, to allow the exchange of information between external systems.\r\nThe session will start with an intro to Entando. We will also create an example that will provide an overview of how to develop a service that publishes Open Data on multiple devices (smartphones, tablets...)\r\nThe aim will be to show how using REST API’s we can extend the reach of a portal and its adoption in an organisation.\r\nEntando is an OS Java based portal platform that allows developers to easily make vertical applications or develop & deploy enterprise portals including rich CMS capabilities. Our commitment to remain open source & our passion for opening the world of web to those with visual impairments has made us successful in government sectors & we will profile some success stories of our use of REST API’s in large government deployments in Italy including the Civil protection & the Ministry of Justice.",
       "room": "Room 7",
       "speaker": "Rinaldo Bonazzo",
       "day": "2012-11-15",
       "from": "13:10",
       "to": "13:25",
       "type": "Quickie",
       "speakers": [
        "Rinaldo Bonazzo"
       ],
       "tags": [
        "HTML5",
        "REST",
        "Twitter",
        "spring",
        "web20"
       ]
      }
     ]
    },
    {
     "slot": "13:35",
     "talks": [
      {
       "id": 975,
       "title": "How to Make your Code OSGi-Friendly Without Depending on OSGi",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1808",
       "summary": "OSGi is increasingly important, but has not (yet) taken over the world. Unfortunately some libraries make mistakes that render them very difficult to use in OSGi -- and also will make them difficult to use in other module systems such as Jigsaw. For example loading classes dynamically and making assumptions about where a class can be loaded from.\r\n\r\nIn this short talk I will describe how to avoid making such mistakes, and how to build a library that is friendly towards OSGi and modularity in general, without actually tying it to OSGi.",
       "room": "Room 8",
       "speaker": "Neil Bartlett",
       "day": "2012-11-15",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Neil Bartlett"
       ],
       "tags": [
        "modules",
        "jigsaw",
        "osgi"
       ]
      },
      {
       "id": 976,
       "title": "Why & How: JSON validation with JSON Schema and Jackson",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1936",
       "summary": "This quickie will briefly introduce you to JSON schema, explaining what you can gain (or not) by validating your JSON documents, and how to do so using the popular Jackson library.",
       "room": "Room 5",
       "speaker": "Stephane Rondal",
       "day": "2012-11-15",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Stephane Rondal"
       ],
       "tags": [
        "JSON"
       ]
      },
      {
       "id": 977,
       "title": "The Future of Software Development Process Methodology Effectiveness (Part 2/2)",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2114",
       "summary": "A short history, overview, and future of software development process.\r\nDo you have enough process in your process?\r\nNo: You can *never* have enough process.\r\nSo hire someone expensive to help you out.\r\nIn the meantime, come to this talk and find out what it's all about, with charts, graphs, and bullet points for enhanced effectiveness.",
       "room": "Room 4",
       "speaker": "Chet haase Software process methodologist",
       "day": "2012-11-15",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Chet haase Software process methodologist"
       ],
       "tags": [
        "Methodology",
        "scrum",
        "agile"
       ]
      },
      {
       "id": 978,
       "title": "Easy Entity Auditing with Hibernate Envers",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1946",
       "summary": "On last week-end, your boss had a great idea - another one - for the application: why not adding an audit trail to track the activities of the users?\r\nWith your usual luck, it is incumbent upon you to implement this task!\r\nI can feel your pain. But don't worry, it's not all over! Did you ever heard of Hibernate Envers?\r\n\r\nSo come and discover this powerful Hibernate extension, which allows you to manage audit functions with ease, and provides an extensive API to dive into your auditing data without any trouble.\r\n\r\n@Audit will have no secrets for you!",
       "room": "Room 9",
       "speaker": "Romain Linsolas",
       "day": "2012-11-15",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Romain Linsolas"
       ],
       "tags": [
        "javase",
        "javaee",
        "Hibernate"
       ]
      },
      {
       "id": 979,
       "title": "Spock: boldly go where no test has gone before",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1855",
       "summary": "Testing, testing, testing. We all know it has to be done but no one likes to do it. Enter Spock, a revolutionary way to writing (and thinking about) test code, that promises to wash away the pain and bring back the fun. And you know what? It delivers. It's logical after all ;-)",
       "room": "Room 6",
       "speaker": "Andres Almiray",
       "day": "2012-11-15",
       "from": "13:35",
       "to": "13:50",
       "type": "Quickie",
       "speakers": [
        "Andres Almiray"
       ],
       "tags": [
        "javase",
        "Spock",
        "groovy"
       ]
      }
     ]
    },
    {
     "slot": "14:00",
     "talks": [
      {
       "id": 909,
       "title": "The Mocha Raspberry Pi Lab",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1675",
       "summary": "The Rasberry Pi is a $25, credit-card sized computer that that plugs in to a TV and keyboard.  It includes an ARM chip that is powerful enough to run a full version of Java SE including JavaFX.  In this lab you will get a chance to test out Java and JavaFX technology running on a very accessible embedded platform.  With a full Java Virtual Machine at your disposal, the possibilities are endless!",
       "room": "BOF 1",
       "speaker": "Stephen Chin",
       "day": "2012-11-15",
       "from": "14:00",
       "to": "17:00",
       "type": "Hands-on Labs",
       "speakers": [
        "Stephen Chin",
        "Simon Ritter"
       ],
       "tags": [
        "javafx",
        "javase",
        "graphics"
       ]
      },
      {
       "id": 910,
       "title": "Nashorn: Optimizing JavaScript and Dynamic Language Execution on the JVM",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2115",
       "summary": "There are many implementations of JavaScript, meant to run either on the JVM or standalone as native code. Both approaches have their respective pros and cons. The soon-to-be open sourced Oracle Nashorn JavaScript project is based on the former approach. This presentation goes through the performance work that has gone on in Oracle’s Nashorn JavaScript project to date in order to make JavaScript-to-bytecode generation for execution on the JVM feasible. Aside from covering the Nashorn project itself, we show that the new invoke dynamic bytecode gets us part of the way there but may not quite be enough. What other tricks did the Nashorn project use? The presentation also discusses future directions for increased performance for dynamic languages on the JVM, covering proposed enhancements to both the JVM itself and to the bytecode compiler.",
       "room": "Room 3",
       "speaker": "Marcus Lagergren",
       "day": "2012-11-15",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Marcus Lagergren"
       ],
       "tags": [
        "javase",
        "javascript",
        "JVM",
        "Java8"
       ]
      },
      {
       "id": 911,
       "title": "JSR 352: Batch applications for the Java Platform.",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1966",
       "summary": "Batch processing is a pervasive workload pattern across virtually every industry,  applied to such tasks as statement generation, bank postings, risk evaluation, credit score calculation, inventory management, portfolio optimization, and on and on. However, there is no industry standard for a Java batch architecture, at least until now. JSR 352 defines a standard programming model on Java SE and EE to build batch applications and submit/manage Java batch jobs.",
       "room": "Room 8",
       "speaker": "Sajan Sankaran",
       "day": "2012-11-15",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Sajan Sankaran"
       ],
       "tags": [
        "javase",
        "javaee",
        "JSR"
       ]
      },
      {
       "id": 912,
       "title": "Bootstrapping Android Apps with Open Source",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2076",
       "summary": "As the general quality of Android apps grow, the pressure on developers to deliver an amazing experience also increases. Learn how to empower development by leveraging the efforts of the open source community rather than become overwhelmed under the requirements of a new application.\r\n\r\nApplication development is becoming an increasingly complex process. Providing the latest widgets and UI patterns, dependency injection and state management, interacting with RESTful APIs, and choosing the right combination of helper classes is a full-time job--and we haven't even begun to get to the content and styling of your app. Thankfully various companies and individuals provide a myriad of libraries to alleviate this burden so that you can maximize the amount of time spent on providing the best user experience.",
       "room": "Room 5",
       "speaker": "Jake Wharton",
       "day": "2012-11-15",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Jake Wharton"
       ],
       "tags": [
        "android",
        "mobile"
       ]
      },
      {
       "id": 913,
       "title": "Gamestorming for Software Developers",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1648",
       "summary": "\"Hopefully this meeting is over soon, and I can get back to my desk to get some real work done!\" \r\n\r\nMeetings are an essential part of software development. We gather with our colleagues in the hope of finding innovative solutions to our problems or generating breakthrough new ideas. But yet, most meetings are dull, monopolized by a few and more often than not they produce no satisfying results.\r\n\r\nBut in recent years a new trend emerged to fight the abyss of unproductive meetings: Gamestorming - creative games instead of endless discussions. In this talk we will explore why Gamestorming is so successful, why games are not only more fun, but can help us to generate more and better ideas, too. And we will look at some important rules and guidelines to follow while conducting games in meetings.\r\n\r\nTo round it off we will go over some of the most popular and effective games that are particularly useful in the context of software engineering.",
       "room": "Room 4",
       "speaker": "Michael Heinrichs",
       "day": "2012-11-15",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Michael Heinrichs"
       ],
       "tags": [
        "collaboration",
        "agile"
       ]
      },
      {
       "id": 914,
       "title": "Simplicity in Scala Design",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2073",
       "summary": "This talk will focus on how to achieve simplicity in Scala library, DSL, and application design. It will highlight general principles that can be applied to any programming language, and show specific techniques that can be used in Scala to \"implement\" the general principles. This talk will give you a set of concrete guidelines that can help you manage complexity in your Scala projects.",
       "room": "Room 9",
       "speaker": "Bill Venners",
       "day": "2012-11-15",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Bill Venners"
       ],
       "tags": [
        "scala",
        "Design"
       ]
      },
      {
       "id": 915,
       "title": "Javascript Unit testing & Build integration",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2108",
       "summary": "Unit testing has become very popular with the rise of test-first software development. Most enterprise applications contain only a small portion of javascript code, almost always completely untested. We have seen a steady increase of javascript code and frameworks lately, but for most people it's still unclear how to (unit) test javascript, and most of all how to properly integrate these within your build environment next to other JUnit test cases. This presentation sheds some light on why javascript testing isn't very popular and how we can do something about it: how to test, what to test and how to integrate the whole thing.",
       "room": "Room 6",
       "speaker": "Wouter Groeneveld",
       "day": "2012-11-15",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Wouter Groeneveld"
       ],
       "tags": [
        "Testing",
        "javascript",
        "jUnit"
       ]
      },
      {
       "id": 916,
       "title": "Up up and Out: Scaling software with Akka",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1747",
       "summary": "We believe that one should never have to choose between productivity and scalability, which has been the case with traditional approaches to concurrency and distribution. The cause of that has been the wrong tools and the wrong layer of abstraction and Akka is here to change that. \r\n\r\nAkka is an, open source, unified runtime and programming model for scaling both UP (utilizing multi-core processors) and OUT (utilizing the grid/cloud). With Akka this will be taken to a whole new level with its “Distributed by Design”. Akka provides location transparency by abstracting away both these tangents of scalability by turning them into an operations and configuration task. This gives the Akka runtime freedom to do adaptive automatic load-balancing, cluster rebalancing, replication and partitioning. \r\n\r\nIn this talk you will learn what Akka is and how it can be used to solve hard scalability problems. Akka is available at http://akka.io (under Apache 2 license).",
       "room": "Room 7",
       "speaker": "Jonas Bonér",
       "day": "2012-11-15",
       "from": "14:00",
       "to": "15:00",
       "type": "Conference",
       "speakers": [
        "Jonas Bonér"
       ],
       "tags": [
        "javase",
        "scalable",
        "javaee",
        "asynchronous",
        "scala",
        "clusters",
        "actors",
        "Akka"
       ]
      }
     ]
    },
    {
     "slot": "15:10",
     "talks": [
      {
       "id": 918,
       "title": "JavaFX Mashups",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2130",
       "summary": "A mix of content or functionality from two or more Web-based services has become known as a mashup. This presentation takes the mashup concept one step further by mixing Web content and scripts with a JavaFX program, effectively blurring the line between Web and application. This is made possible by the powerful WebView component of JavaFX. The session shows how to display Web content in a JavaFX application and how to set up two-way communications between the Java code and JavaScript code run in WebView. It includes several cool and creative examples based on this technique.",
       "room": "Room 3",
       "speaker": "Pär Sikö",
       "day": "2012-11-15",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Pär Sikö",
        "Martin Gunnarsson"
       ],
       "tags": [
        "javafx"
       ]
      },
      {
       "id": 919,
       "title": "JSR 353 : Java API for JSON Processing",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1644",
       "summary": "JSON is a lightweight data exchange format used increasingly in RESTful Web services by highly visible Websites (Facebook, Twitter, Amazon, and the like). The format is easy for humans and machines to read and write. JSON is quickly becoming the primary choice for developers for consuming and creating Web services. JSR 353: Java API for JSON Processing intends to create a standard Java API for JSON so that the applications that use the API are smaller and portable. The goal of the API is to produce/consume JSON text in a streaming fashion and also to build a Java object model for JSON text. Attend this session for the JSR update, discussion of the API, and information on how to utilize this API in applications.",
       "room": "Room 8",
       "speaker": "Jitendra Kotamraju",
       "day": "2012-11-15",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Jitendra Kotamraju"
       ],
       "tags": [
        "JSON"
       ]
      },
      {
       "id": 920,
       "title": "JavaPosse LIVE",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2084",
       "summary": "LIVE recording of the 400th JavaPosse podcast.",
       "room": "Room 5",
       "speaker": "Dick Wall",
       "day": "2012-11-15",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Dick Wall",
        "Carl Quinn",
        "Tor Norbye"
       ],
       "tags": [
        "JavaPosse",
        "Podcast"
       ]
      },
      {
       "id": 921,
       "title": "An analysis of CVE-2012-2122, MySQL authentication",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2087",
       "summary": "An examination of the recently publicised MySQL authentication bypass, technically known as CVE-2012-2122 and how this flaw came to be.  How does this affect the use of MySQL in the community and where do we go from here?  We will also look at previous issues in the MySQL authentication code base over the years.  Code examined is written in C however the principles discussed apply to the practices common to all developers.",
       "room": "Room 4",
       "speaker": "Cambell Murray",
       "day": "2012-11-15",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Cambell Murray"
       ],
       "tags": [
        "security",
        "MySQL"
       ]
      },
      {
       "id": 922,
       "title": "From Enterprise Pony to SaaSy Unicorn in 60 Days",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1779",
       "summary": "We will be sharing Atlassian’s experience in taking our ten year old enterprise software products and turning them into a service, culminating in the creation of a global operations team and spinning up over 20,000 JVMs in 60 days.\r\n\r\nThe audience should expect to gain insight into the complexities of taking an enterprise software project into the SaaS space, and take away valuable insight into:\r\n\r\n- Why giving customers individual instances of our products proved easier and cheaper than building the multi-tenancy holy grail\r\n- Why we chose to build our own cloud (Unicorn)\r\n- Challenges in building and running a global operations team across three timezones \r\n- Lessons learnt introducing DevOps concepts to our (typically) enterprise-focused development teams. \r\n- Planning for and coping with extreme growth",
       "room": "Room 9",
       "speaker": "Patrick Debois",
       "day": "2012-11-15",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Patrick Debois"
       ],
       "tags": [
        "javaee"
       ]
      },
      {
       "id": 923,
       "title": "Connecting an enterprise’s Java based reporting infrastructure to Salesforce.com data",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2106",
       "summary": "With the growing use of SFDC data in the enterprise DataDirect explores the possibilities to allow central access from Business Systems to SFDC data.\r\n\r\nTo access SFDC data at a lower level SFDC provides a number of Web Services calls, DataDirect have written a JDBC driver to connect to SFDC via the exposed web services.\r\n\r\nDataDirect will demonstrate how easy it is to connect to SFDC to reporting infrastructure and reduce cost by reducing the number of Web Services call by caching as well how to bulk update to SFDC can be run centrally.",
       "room": "Room 6",
       "speaker": "Paul Griffin",
       "day": "2012-11-15",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Paul Griffin"
       ],
       "tags": [
        "SalesForce",
        "DataDirect"
       ]
      },
      {
       "id": 924,
       "title": "Defragmenting mobile HTML5 web apps",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1658",
       "summary": "With all the fragmentation across mobile devices, knowing how to support, test, and gracefully degrade new HTML5 related features can lead to many nights of heavy drinking.\r\nFortunately, there are a handful of W3C specifications that can be used now and are widely supported across all modern web browsers. \r\nWe’ll code live demos showing how to use device features such as the accelerometer, Web Storage, Web Sockets, Geolocation and Web Workers.",
       "room": "Room 7",
       "speaker": "Wesley Hales",
       "day": "2012-11-15",
       "from": "15:10",
       "to": "16:10",
       "type": "Conference",
       "speakers": [
        "Wesley Hales"
       ],
       "tags": [
        "mobile"
       ]
      }
     ]
    },
    {
     "slot": "16:40",
     "talks": [
      {
       "id": 927,
       "title": "The present and the future of JAX-RS and Jersey",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1633",
       "summary": "A lot has happened since the Devoxx last year where feature plans for the next major JAX-RS 2.0 API release were presented. \r\n\r\nNow that the work on JSR 339 is over and with the steaming fresh final JAX-RS 2.0 and Jersey 2.0 release out of the door it is a great time to reiterate over the new noteworthy additions to the API such as the new client API, filters and interceptors, asynchronous resources, data validation, improved content negotiation or hyperlinking and show some of them directly in action running on Jersey 2.0.\r\n\r\nAs title suggests, the last part of the talk will be focused on discussing early future plans for either the JAX-RS API or new Jersey features.",
       "room": "Room 8",
       "speaker": "Marek Potociar",
       "day": "2012-11-15",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Marek Potociar"
       ],
       "tags": [
        "javaee",
        "REST",
        "JAX-RS",
        "jersey"
       ]
      },
      {
       "id": 928,
       "title": "Disruptive Media",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1756",
       "summary": "New APIs and standards can democratise content creation and communication: for telephony, gaming, video production, music making, news gathering and many other applications. In this session, we help you understand the new APIs and show off some stunning real-world implementations.\r\n\r\n* WebRTC implements open standards for realtime, plugin-free video, audio and data communication\r\n* getUserMedia() gives access to user-generated video and audio\r\n* CSS, WebGL and the canvas element make complex visual manipulation and animation effective and efficient\r\n* The Media Source API enables native adaptive streaming, and the new Media encryption APIs enable the video and audio elements to play encrypted media\r\n* The HTML track element enables deep linking, deep search and has huge potential to improve media accessibility\r\n* The Gamepad, USB, Geolocation, Orientation and other APIs provide open standards for device access\r\n* The Web Audio API enables sophisticated audio processing in the browser",
       "room": "Room 5",
       "speaker": "Sam Dutton",
       "day": "2012-11-15",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Sam Dutton"
       ],
       "tags": [
        "HTML5",
        "webgl",
        "web"
       ]
      },
      {
       "id": 929,
       "title": "Security Testing Android with Mercury",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2110",
       "summary": "The widely publicized malware on the Android Marketplace relies on the fact that users do not review permissions when installing applications. A lesser known fact is that an installed application with no special permissions will often be able to access a user's most sensitive data regardless. Upon reviewing multiple Android handsets and applications, the sheer number of information disclosure vulnerabilities found was alarming.\r\n\r\nMercury is a tool that allows its user to dynamically examine the attack surface of applications that reside on a device and demonstrate how they may be exploited.",
       "room": "Room 4",
       "speaker": "Daniel Bradberry",
       "day": "2012-11-15",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Daniel Bradberry"
       ],
       "tags": [
        "security",
        "android",
        "Tools"
       ]
      },
      {
       "id": 930,
       "title": "Functional Compilers: From CFG to EXE",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2088",
       "summary": "Martin Fowler once said that there are two types of people in this world: those\r\nwho didn't take compilers at the university and are afraid of them, and those\r\nwho took compilers at the university and are afraid of them.  Compilers are\r\nsome of the most complex and theoretically-rich pieces of software in existence.\r\nEach one requires careful and well considered design to avoid becoming a tangled\r\nmorass of meta-generators and bailing wire.\r\n\r\nThis talk will look at the construction of a simple compiler in Scala.  We will\r\nexamine some of the tools Scala gives us that can dramatically simplify the task\r\nof writing and testing a compiler, and in the process, gain an appreciation for\r\nwhat compilers look like and how to build your own.",
       "room": "Room 9",
       "speaker": "Daniel Spiewak",
       "day": "2012-11-15",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Daniel Spiewak"
       ],
       "tags": [
        "scala",
        "FunctionalProgramming"
       ]
      },
      {
       "id": 931,
       "title": "Re-imagining the browser with AngularJS",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1691",
       "summary": "What if you could write modern web apps with dramatically fewer lines of code and improve its readability and expressiveness at the same time? No, there’s no new language to learn. Just familiar old HTML and JavaScript. As a matter of fact, there’s some stuff for you to un-learn.\r\n\r\nAngularJS is a client-side JavaScript web development framework where we believe we’ve done something special. We’ve approached the problem let’s say differently from the way any other JavaScript tool has before. Instead of asking what kind of functions we could provide to make writing apps smoother, we asked “what if the browser worked differently in a way that eliminates code and gives structure to apps?”\r\n\r\nThis talk will take the audience on a tour of what the web platform of the future will look like and how the AngularJS framework can provide many of the powerful capabilities to existing browsers and bridge the path to web components, model driven views and other platform features that are currently being spec-ed.",
       "room": "Room 6",
       "speaker": "Igor Minar",
       "day": "2012-11-15",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Igor Minar",
        "Misko Hevery"
       ],
       "tags": [
        "HTML5",
        "javascript",
        "TDD",
        "RIA"
       ]
      },
      {
       "id": 932,
       "title": "What's New in Android Developers’ Tools",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2090",
       "summary": "A tour of everything that’s new in Android developer tools, with guidance on how to use them for best results.",
       "room": "Room 7",
       "speaker": "Tor Norbye",
       "day": "2012-11-15",
       "from": "16:40",
       "to": "17:40",
       "type": "Conference",
       "speakers": [
        "Tor Norbye",
        "Xavier Ducrohet"
       ],
       "tags": [
        "SDK",
        "android",
        "Tools"
       ]
      }
     ]
    },
    {
     "slot": "17:50",
     "talks": [
      {
       "id": 934,
       "title": "Apache TomEE, Java EE 6 Web Profile on Tomcat",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2068",
       "summary": "Apache TomEE is the Java EE 6 Web Profile certified version of Apache Tomcat and combines the simplicity of Tomcat with the power of Java EE. The first half of this session introduces TomEE and shows how Tomcat applications leveraging Java EE technologies can become simpler and lighter with a Java EE 6 certified solution built right on Tomcat. The second half focuses on those already familiar with TomEE and goes into detail on latest advancements, testing techniques including Arquillian, clustering features and production considerations. If you're a Tomcat lover or a TomEE enthusiast, this is the session you don't want to miss!",
       "room": "Room 8",
       "speaker": "David Blevins",
       "day": "2012-11-15",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "David Blevins"
       ],
       "tags": [
        "javaee",
        "web",
        "clusters",
        "apache",
        "javaee6"
       ]
      },
      {
       "id": 935,
       "title": "JavaScript for Java Developers",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1503",
       "summary": "Some developers have an impression that JavaScript is a second-league interpreted language with the main purpose of making Web pages a little prettier. But JavaScript is a powerful, flexible, dynamically typed language. JavaScript functions are the first class citizens that can live their own lives. But mastering JavaScript can present a challenge to Java developers who quickly find themselves in the Wild West Land of dynamic programming.\r\n\r\nWhy you may want to learn JavaScript? \r\n\r\nFirst, learning how things done in another language makes you a better Java developer. \r\nSecond, HTML5 becomes a new buzzword and adding JavaScript to your skill set make you more valuable software developer. You may not know the best kept secret – any HTML5 project is about learning some new tags, APIs and CSS,but mainly it’s about writing JavaScript code.\r\n\r\nThe goal of this presentation is to introduce you to this interesting language highlighting the differences with the Java way of doing stuff.",
       "room": "Room 5",
       "speaker": "Yakov Fain",
       "day": "2012-11-15",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Yakov Fain"
       ],
       "tags": [
        "javascript"
       ]
      },
      {
       "id": 936,
       "title": "The Problem With Women: A Technical Approach",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2128",
       "summary": "We all know \"there are not enough women in technology\". And we all know that this is a Bad Thing. For years we've been seeing attempts to address the balance, and yet nothing seems to make any difference. It's time to explore the hypothesis that the approaches we've been taking are not only not working, but even potentially damaging. This session:\r\n\r\n - Dissects the problem\r\n - Determines the requirements to be met\r\n - Explores the domain\r\n - Designs solutions\r\n - Suggests methods of testing the success of the designs\r\n\r\nThis is NOT a women-only event, men are encouraged to come and participate.\r\n\r\nBring along a sense of humor and an open mind.",
       "room": "Room 3",
       "speaker": "Trisha Gee",
       "day": "2012-11-15",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Trisha Gee"
       ],
       "tags": [
        "women",
        "technology"
       ]
      },
      {
       "id": 937,
       "title": "Progressing Parleys.com, a Java based e-Learning platform",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2049",
       "summary": "Devoxx and BeJUG founder Stephan Janssen and Parleys software engineer, Jo Voordeckers (JavaFX Parleys JavaOne'08 keynote demo) invite the audience to a look behind the scenes of one of the well-known e-Learning sites in the Java community. \r\nOver the past 6 years Parleys has been steadily growing in content and users, this requires continuous improvements in infrastructure, architecture and technologies. Stephan and Jo will talk about the challenges and lessons learned while transitioning the platform from a Confluence plug-in running on a single Tomcat instance, to a monolithic Spring/Hibernate/EHCache/Flex deployment on Glassfish and recently to a lightweight JavaEE6/MongoDB/HTML5 stack running on a clustered Glassfish.",
       "room": "Room 4",
       "speaker": "Jo Voordeckers",
       "day": "2012-11-15",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Jo Voordeckers",
        "Benjamin Dobler",
        "Stephan Janssen"
       ],
       "tags": [
        "HTML5",
        "Glassfish",
        "performance",
        "MongoDB",
        "parleys",
        "Hibernate",
        "spring",
        "javaee6"
       ]
      },
      {
       "id": 938,
       "title": "What's new in Groovy 2.0?",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1792",
       "summary": "Groovy is a popular language for the JVM which brings more developer productivity and more performance after each release. After an overview of key features of Groovy 1.8, we'll dive through the new features of Groovy 2.0.\r\n\r\nLots of Groovy users are using the language as a Java scripting language. Not all need the dynamic capabilities, nor do they need all the library improvements provided by Groovy. For the latter, Groovy becomes more modular with smaller core modules that you can compose. For the former, Groovy 2.0 adds static type checking, allowing you to ensure the correctness of your code before it ships and quickly spot early errors at compile time. \r\n\r\nAlso not everybody needs dynamic features at all times: With static compilation, Groovy 2.0 generates fast bytecode like Java and shields key parts of your code base from possible interferences of dynamic features. But when you need fast and performant dynamic logic, Groovy 2.0 also features the integration of the JDK 7 \"invoke dynamic\" support.",
       "room": "Room 9",
       "speaker": "Guillaume Laforge",
       "day": "2012-11-15",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Guillaume Laforge",
        "Cédric Champeau"
       ],
       "tags": [
        "groovy"
       ]
      },
      {
       "id": 940,
       "title": "Writing Your Own JavaFX UI Controls",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1962",
       "summary": "<placeholder>\r\nAlthough JavaFX 2 includes many UI controls, there is often a need to write your own. This session walks you through the options that are available to you and demonstrates how to go about building a custom UI control for your needs.\r\n</placeholder>",
       "room": "Room 7",
       "speaker": "Jonathan Giles",
       "day": "2012-11-15",
       "from": "17:50",
       "to": "18:50",
       "type": "Conference",
       "speakers": [
        "Jonathan Giles"
       ],
       "tags": [
        "javafx"
       ]
      }
     ]
    },
    {
     "slot": "19:00",
     "talks": [
      {
       "id": 942,
       "title": "Duchess meetup and unconference",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1704",
       "summary": "This will be a meetup for all the people interested in Duchess (women in Java).\r\nIt will be informal and as it is an unconference the topic is up to the attendees.",
       "room": "BOF 1",
       "speaker": "Regina Ten bruggencate",
       "day": "2012-11-15",
       "from": "19:00",
       "to": "20:00",
       "type": "BOF",
       "speakers": [
        "Regina Ten bruggencate"
       ],
       "tags": [
        "JUG",
        "Duchess"
       ]
      },
      {
       "id": 943,
       "title": "JAX-RS 2.0 Status & Directions",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1668",
       "summary": "Session gives an overview of latest JAX-RS 2.0 developments and outlook for the future. Extensive Q&A welcome.",
       "room": "BOF 2",
       "speaker": "Jan Algermissen",
       "day": "2012-11-15",
       "from": "19:00",
       "to": "20:00",
       "type": "BOF",
       "speakers": [
        "Jan Algermissen",
        "Marek Potociar"
       ],
       "tags": [
        "JAX-RS"
       ]
      }
     ]
    },
    {
     "slot": "20:00",
     "talks": [
      {
       "id": 944,
       "title": "JUG Leaders BOF",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1711",
       "summary": "The annual Devoxx free for all with JUG Leaders and Java Champions.  A free and open exchange of ideas with Oracle and each other is par for the course in this BOF.",
       "room": "BOF 1",
       "speaker": "Stephan Janssen",
       "day": "2012-11-15",
       "from": "20:00",
       "to": "21:00",
       "type": "BOF",
       "speakers": [
        "Stephan Janssen",
        "Martijn Verburg"
       ],
       "tags": [
        "javase",
        "JUG"
       ]
      },
      {
       "id": 945,
       "title": "JBoss Application Server - Community BOF",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2001",
       "summary": "Come to discuss the present and future of the JBoss Application Server project with members of the JBoss Core Development Team.",
       "room": "BOF 2",
       "speaker": "Dimitris Andreadis",
       "day": "2012-11-15",
       "from": "20:00",
       "to": "21:00",
       "type": "BOF",
       "speakers": [
        "Dimitris Andreadis"
       ],
       "tags": [
        "javaee",
        "jboss"
       ]
      }
     ]
    },
    {
     "slot": "21:00",
     "talks": [
      {
       "id": 948,
       "title": "Tools for Java EE 7: Evolution or Revolution?",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1615",
       "summary": "In many ways, Java EE 7 is certainly an evolutionary revision of the EE platform, delivering incremental improvements of existing technologies and standards. However, some aspects of the platform are, in a subtle way, rather revolutionary. Together with the advances of client-side web technologies, such as HTML5, CSS3, Web sockets or JavaScript libraries and frameworks, Java EE 7 will accelerate the transition to a new breed of applications, in which the client side completely drives the user interface. Going forward, tools will play a crucial role in this transition. In this BOF, we will discuss how Java EE 7 will enable both incremental improvements of existing tools, as well as new tools that support the new application model.",
       "room": "BOF 2",
       "speaker": "Petr Jiricka",
       "day": "2012-11-15",
       "from": "21:00",
       "to": "22:00",
       "type": "BOF",
       "speakers": [
        "Petr Jiricka"
       ],
       "tags": [
        "HTML5",
        "javaee",
        "Tools"
       ]
      }
     ]
    }
   ]
  },
  {
   "day": "2012-11-16",
   "slots": [
    {
     "slot": "09:30",
     "talks": [
      {
       "id": 982,
       "title": "Annotation Features in JDK 8",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2043",
       "summary": "While large language changes are afoot in JDK 8, annotations are getting some enhancements too! Come hear about design and implementation issues in repeating annotations, annotations on types (JSR 308), and annotation processing. While small, these features touch all of the language, the VM, and the core API. For annotation processing while the original annotation processing tool, apt, has been removed, the successor API javax.lang.model could be available at compile time as well as at runtime.",
       "room": "Room 8",
       "speaker": "Joel Borggren-franck",
       "day": "2012-11-16",
       "from": "09:30",
       "to": "10:30",
       "type": "Conference",
       "speakers": [
        "Joel Borggren-franck"
       ],
       "tags": [
        "openjdk",
        "JDK8"
       ]
      },
      {
       "id": 983,
       "title": "Search, the Final Frontier",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2095",
       "summary": "Elasticsearch is built using Java, but works extremely hard to abstract away its \"Javaness\" so it can be easily consumable by many different languages. On the other hand, for people using the JVM, it provides a rich set of APIs and can be easily embeddable. In this session, we will go through some of the design concepts that were used to make elasticsearch so easily consumable from other languages, while still maintain its embedded nature, including live coding examples.",
       "room": "Room 5",
       "speaker": "Shay Banon",
       "day": "2012-11-16",
       "from": "09:30",
       "to": "10:30",
       "type": "Conference",
       "speakers": [
        "Shay Banon"
       ],
       "tags": [
        "search",
        "JAX-RS",
        "cloud"
       ]
      },
      {
       "id": 984,
       "title": "Clustering your application with Hazelcast",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2118",
       "summary": "Today's applications are getting more and more distributed everyday and it is well-known that distributed programming is hard. With Hazelcast though, distributed programming is easy and lots of fun. A common reaction of Hazelcast users is 'Ooh my God, this cannot be that easy'. Hazelcast is an open source, highly scalable, transactional, distributed/partitioned implementation of queue, map, set, list, lock and executor services for Java. Hazelcast is for you if you like to easily: share data/state among many servers (e.g. web session sharing), cache your data (distributed cache), cluster your application, partition your in-memory data, send/receive messages among applications, distribute workload onto many servers, take advantage of parallel processing or provide fail-safe data management.",
       "room": "Room 9",
       "speaker": "Talip Ozturk",
       "day": "2012-11-16",
       "from": "09:30",
       "to": "10:30",
       "type": "Conference",
       "speakers": [
        "Talip Ozturk"
       ],
       "tags": [
        "cache",
        "scalable",
        "clusters",
        "caching"
       ]
      },
      {
       "id": 985,
       "title": "Cloud Robotics",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2109",
       "summary": "A world filled with personal robots is inevitable but a lack of strong software infrastructure to support those robots is slowing progress. By offloading CPU and data intensive computation to the cloud, we can make robots lighter, cheaper, and smarter. The same developers that work on commodity web and mobile apps today can accelerate the pace of robotics research and development if we make high functioning robots affordable and universally accessible.",
       "room": "Room 4",
       "speaker": "Damon Kohler",
       "day": "2012-11-16",
       "from": "09:30",
       "to": "10:30",
       "type": "Conference",
       "speakers": [
        "Damon Kohler"
       ],
       "tags": [
        "robotics",
        "cloud"
       ]
      }
     ]
    },
    {
     "slot": "10:45",
     "talks": [
      {
       "id": 953,
       "title": "Building Amazing Applications with JavaFX",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1636",
       "summary": "Customers rank visual appearance and user experience as major considerations. Many developers believe that the #1 differentiator from the competition is how an application looks. For enterprise applications, the look and style of an application were often afterthoughts, but now they’re among the top considerations. You can think of this as the “Apple effect.” Apple has taught the world that design matters, and that is influencing customers’ purchasing decisions even when it comes to enterprise software. JavaFX is well situated to help you design applications that will impress any customer. This session shows how to build well-designed applications with JavaFX and features such as CSS, Scene Builder, and custom controls.",
       "room": "Room 8",
       "speaker": "Jasper Potts",
       "day": "2012-11-16",
       "from": "10:45",
       "to": "11:45",
       "type": "Conference",
       "speakers": [
        "Jasper Potts",
        "Richard Bair"
       ],
       "tags": [
        "javafx"
       ]
      },
      {
       "id": 954,
       "title": "JSR 356 : The Java API for WebSocket",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2104",
       "summary": "The family of HTML5 technologies has pushed the pendulum away from rich client technologies and toward ever-more-capable Web clients running on today’s browsers. In particular, WebSocket brings new opportunities for efficient peer-to-peer communication, providing the basis for a new generation of interactive and “live” Web applications. This session examines the efforts under way to support WebSocket in the Java programming model, from its base-level integration in the Java Servlet and Java EE containers to a new, easy-to-use API and toolset that are destined to become part of the standard Java platform.",
       "room": "Room 5",
       "speaker": "Jitendra Kotamraju",
       "day": "2012-11-16",
       "from": "10:45",
       "to": "11:45",
       "type": "Conference",
       "speakers": [
        "Jitendra Kotamraju"
       ],
       "tags": [
        "HTML5",
        "javaee",
        "websockets"
       ]
      },
      {
       "id": 955,
       "title": "50 Tips in 50 Minutes for GlassFish Fans",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1549",
       "summary": "This fast-paced session presents 50 tips and tricks for using GlassFish Server technology. Learn about features for both GlassFish Server Open Source Edition and Oracle GlassFish Server that you might have never known existed. Become a more productive GlassFish user. Presented by two GlassFish experts, the session offers tips to help novice users as well as seasoned developers get the most out of GlassFish. The tips cover a range of subjects including debugging, monitoring, deployment, custom command creation, REST fun, and much more.",
       "room": "Room 4",
       "speaker": "Romain Grécourt",
       "day": "2012-11-16",
       "from": "10:45",
       "to": "11:45",
       "type": "Conference",
       "speakers": [
        "Romain Grécourt"
       ],
       "tags": [
        "Glassfish",
        "javaee"
       ]
      },
      {
       "id": 956,
       "title": "mgwt - GWT goes mobile",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1974",
       "summary": "Building mobile apps and webpages with mgwt & gwt-phonegap is a great way to build cross platform mobile apps in Java. Especially porting your existing GWT apps becomes incredibly easy.\r\nWith Phonegap you can build cross platform apps based on web standards. This can be done with Javascript. GWT on the other hand is an excellent tool for building fast Javascript apps in Java, but it is missing some key parts for building great mobile apps with it. The two open source projects mgwt and gwt-phonegap close this gap: mgwt provides mobile widgets, that look like native widgets for different platforms - gwt-phonegap enables GWT apps to use Phonegap. \r\nPutting these frameworks to work creates performant mobile apps that feel like native apps while being platform independent.",
       "room": "Room 9",
       "speaker": "Daniel Kurka",
       "day": "2012-11-16",
       "from": "10:45",
       "to": "11:45",
       "type": "Conference",
       "speakers": [
        "Daniel Kurka"
       ],
       "tags": [
        "HTML5",
        "iPhone",
        "performance",
        "CSS3",
        "GWT",
        "javascript",
        "mobile",
        "android"
       ]
      },
      {
       "id": 957,
       "title": "Les Cast Codeurs Podcast",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2097",
       "summary": "LIVE recording of the Cast Codeurs Podcast (French)",
       "room": "BOF 1",
       "speaker": "Emmanuel Bernard",
       "day": "2012-11-16",
       "from": "10:45",
       "to": "11:45",
       "type": "BOF",
       "speakers": [
        "Emmanuel Bernard",
        "Vincent Massol",
        "Guillaume Laforge",
        "Antonio Goncalves"
       ],
       "tags": [
        "Podcast"
       ]
      }
     ]
    },
    {
     "slot": "11:50",
     "talks": [
      {
       "id": 958,
       "title": "Real World Java EE",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2064",
       "summary": "tba",
       "room": "Room 8",
       "speaker": "Adam Bien",
       "day": "2012-11-16",
       "from": "11:50",
       "to": "12:50",
       "type": "Conference",
       "speakers": [
        "Adam Bien"
       ],
       "tags": [
        "Glassfish",
        "javaee"
       ]
      },
      {
       "id": 959,
       "title": "Building Modular Applications with Enterprise OSGi",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1963",
       "summary": "Every Java EE developer is familiar with WAR files and Servlets, and most are familiar with Spring and dependency injection. Those who have used these two technologies together are also painfully aware of how hard it can be to manage the class path and class loaders of their application as they add more library JARs.\r\n\r\nOSGi offers the perfect modularity solution for this “class path hell”, but few developers are aware that you can use WARs and dependency injection within an OSGi framework.\r\n\r\nMoving Java EE applications to an OSGi stack is as easy as possible. In this session we will discuss the basics of the OSGi modularity model, and demo the build tools, middleware, and architectural principles which can be used to turn a chunky WAR into a lean, mean, extensible OSGi web application ! \r\n\r\nWhilst his session is primarily aimed at enterprise developers new to OSGi, much of the content is equally applicable to OSGi development, and is recommended to anyone looking to brush up on their OSGi principles",
       "room": "Room 5",
       "speaker": "Holly Cummins",
       "day": "2012-11-16",
       "from": "11:50",
       "to": "12:50",
       "type": "Conference",
       "speakers": [
        "Holly Cummins",
        "Timothy Ward"
       ],
       "tags": [
        "javaee",
        "osgi"
       ]
      },
      {
       "id": 960,
       "title": "Putting Kotlin to the test",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/1887",
       "summary": "Kotlin is a new OSS programming language from JetBrains, leaders of IDE’s and Developer tools. Its purpose is to provide a general industry focused language that can be used for all types of development, and at the same time, fixing some of the common pitfalls of other languages that can end up being very expensive. That’s the idea behind it at least, but does it hold? In this session we’re going to find out. We’ll put it to the test by creating a real-world application and see if and where it can help and whether it has enough the potential to be a prime runner!",
       "room": "Room 4",
       "speaker": "Hadi Hariri",
       "day": "2012-11-16",
       "from": "11:50",
       "to": "12:50",
       "type": "Conference",
       "speakers": [
        "Hadi Hariri"
       ],
       "tags": [
        "JVM"
       ]
      },
      {
       "id": 961,
       "title": "J2ObjC - A Java to iOS Objective-C translation tool and runtime.",
       "presentationUri": "http://cfp.devoxx.com/rest/v1/events/presentations/2112",
       "summary": "J2ObjC is a new build tool that translates Java library source for use with iOS apps. The tool transpiles Java code to Objective-C during the build, as no hand-editing of the generated code is necessary. J2ObjC supports most Java language and runtime features required by client-side application developers, including exceptions, inner and anonymous classes, generic types,  threads and reflection.\r\n \r\nThis talk describes J2ObjC's design and implementation, and what issues were faced mapping Java to Objective-C. It will also give developers the information they need to use J2ObjC in their own projects.",
       "room": "Room 9",
       "speaker": "Tom Ball",
       "day": "2012-11-16",
       "from": "11:50",
       "to": "12:50",
       "type": "Conference",
       "speakers": [
        "Tom Ball"
       ],
       "tags": [
        "iOS",
        "mobile",
        "android"
       ]
      }
     ]
    }
   ]
  }
 ]
}
